//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
50870  "Великие кружащиеся птицы"50871  "^ffff00Великие кружащиеся птицы^ffcb4aМаг. энергия: ^96f5ff210^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушкаПозволяет мгновенно вернуться на место тени, если расстояние до нее не превышает ^96f5ff50^ffffff м.При использовании после умения 'Великий танец пламени' с сапфировой рунойповторно дается иммунитет к эффектам, ограничивающим передвижение."54150  "Таинственный огневой рубеж"54151  "^ffff00Таинственный огневой рубеж^ffcb4aМаг. энергия: ^96f5ff300^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff60 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aСтатус: ^ffffffСын адаСтрелок призывает под свое управление огневую платформу.В этом состоянии дальность атаки и наносимый урон мгновенно увеличиваются.Дальность увеличивается на ^96f5ff10^ffffff м, урон увеличивается на ^96f5ff100%%^ffffff.После выхода из огневого режима эти эффекты исчезают.^808080В состоянии трансформации нельзя перемещаться, применять обычные умения и умения джинна.^a6caf0В этом состоянии можно использовать только особое умение 'Сияющий звездопад'.Огневая платформа существует ^96f5ff10^a6caf0 сек."54400  "Великая мелькнувшая тень"54401  "^ff5c00Великая мелькнувшая тень^ffcb4aМаг. энергия: ^96f5ff183^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff60,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffручная пушка, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffМудрецНеуловимый блик скользит по водной глади. На ^96f5ff12^ffffff сек. стрелок получает иммунитет к эффектам,ограничивающим передвижение, при этом скорость его передвижения увеличивается на ^96f5ff65%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци."54410  "Великая мелькнувшая тень"54411  "^ff5c00Великая мелькнувшая тень^ffcb4aМаг. энергия: ^96f5ff183^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffМудрецНеуловимый блик скользит по водной глади. На ^96f5ff12^ffffff сек. стрелок получает иммунитет к эффектам,ограничивающим передвижение, при этом скорость его передвижения увеличивается на ^96f5ff65%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^ffcb4aЭффект золотой руны:@1^ffcb4a1-4 ур.: скорость передвижения увеличивается на ^96f5ff70%%^ffcb4a^ffcb4a5-7 ур.: скорость передвижения увеличивается на ^96f5ff80%%^ffcb4a^ffcb4a8-9 ур.: скорость передвижения увеличивается на ^96f5ff90%%^ffcb4a ^ffcb4a10 ур.: скорость передвижения увеличивается на ^96f5ff100%%^ffcb4a^ffcb4a.@1@2Скорость передвижения увеличивается на ^96f5ff%d%%^ffcb4a.@2"54430  "Великая мелькнувшая тень"54431  "^ff5c00Великая мелькнувшая тень^ffcb4aМаг. энергия: ^96f5ff183^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffМудрецНеуловимый блик скользит по водной глади. На ^96f5ff12^ffffff сек. стрелок получает иммунитет к эффектам,ограничивающим передвижение, при этом скорость его передвижения увеличивается на ^96f5ff65%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^00ff00Эффект изумрудной руны:@1^00ff001-4 ур.: иммунитет к эффектам, ограничивающим передвижение, длится ^96f5ff13^00ff00 сек.^00ff005-7 ур.: иммунитет к эффектам, ограничивающим передвижение, длится ^96f5ff14^00ff00 сек.^00ff008-9 ур.: иммунитет к эффектам, ограничивающим передвижение, длится ^96f5ff15^00ff00 сек. ^00ff0010 ур.: иммунитет к эффектам, ограничивающим передвижение, длится ^96f5ff16^00ff00 сек.@1@2Иммунитет к эффектам, ограничивающим передвижение, длится ^96f5ff%d^00ff00 сек.@2"54440  "Великая мелькнувшая тень"54441  "^ff5c00Великая мелькнувшая тень^ffcb4aМаг. энергия: ^96f5ff183^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffМудрецНеуловимый блик скользит по водной глади. На ^96f5ff12^ffffff сек. стрелок получает иммунитет к эффектам,ограничивающим передвижение, при этом скорость его передвижения увеличивается на ^96f5ff65%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^00ffffЭффект сапфировой руны:@1^00ffff1-4 ур.: после применения восстанавливается ^ffffff0,15^00ffff ци^00ffff5-7 ур.: после применения восстанавливается ^ffffff0,20^00ffff ци^00ffff8-9 ур.: после применения восстанавливается ^ffffff0,25^00ffff ци ^00ffff10 ур.: после применения восстанавливается ^ffffff0,30^00ffff ци@1@2^00ffffПосле применения восстанавливается ^ffffff0,%d^00ffff ци.@2"54450  "Великая мелькнувшая тень"54451  "^ff5c00Великая мелькнувшая тень^ffcb4aМаг. энергия: ^96f5ff183^ffffff^ffcb4aПодготовка: ^ffffff0,1^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff60,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffручная пушка, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffМудрецНа ^96f5ff1^ffffff сек. стрелок получает неуязвимость, но при этом на негонакладывается оглушение, которое невозможно рассеять.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^ff0000Эффект рубиновой руны:@1^ff00001-4 ур.: эффект длится ^96f5ff2^ff0000 сек.^ff00005-7 ур.: эффект длится ^96f5ff3^ff0000 сек.^ff00008-9 ур.: эффект длится ^96f5ff4^ff0000 сек. ^ff000010 ур.: эффект длится ^96f5ff5^ff0000 сек.@1@2Время действия эффекта увеличивается до ^96f5ff%d^ff0000 сек.@2"54460  "Великая мелькнувшая тень"54461  "^ff5c00Великая мелькнувшая тень^ffcb4aМаг. энергия: ^96f5ff183^ffffff^ffcb4aПодготовка: ^ffffff0,1^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff200,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffручная пушка, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffМудрецНеуловимый блик скользит по водной глади. На ^96f5ff12^ffffff сек. стрелок получает иммунитет к эффектам,ограничивающим передвижение, при этом скорость его передвижения увеличивается на ^96f5ff65%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^ffeaabЭффект серебряной руны:@1Позволяет использовать умение дважды и сокращает время перезарядки.^ffeaab1-4 ур.: время перезарядки сокращается до ^96f5ff180^ffeaab сек.^ffeaab5-7 ур.: время перезарядки сокращается до ^96f5ff160^ffeaab сек.^ffeaab8-9 ур.: время перезарядки сокращается до ^96f5ff140^ffeaab сек. ^ffeaab10 ур.: время перезарядки сокращается до ^96f5ff120^ffeaab сек.@1@2Позволяет использовать умение дважды и сокращает время перезарядки до ^96f5ff%d^ffeaab сек.@2"55930  "Великое сотрясание гор"55931  "^ff5c00Великое сотрясание гор^ffcb4aДальность: ^96f5ff22^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffАсураПеремещает союзника вперед на ^96f5ff25^ffffff м.В процессе перемещения персонаж неуязвим.^808080Действует только на членов отряда. Невозможно применить на себя."55940  "Великое сотрясание гор"55941  "^ff5c00Великое сотрясание гор^ffcb4aДальность: ^96f5ff22^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffАсураПеремещает союзника вперед на ^96f5ff25^ffffff м.В процессе перемещения персонаж неуязвим.^808080Действует только на членов отряда. Невозможно применить на себя.^ffcb4aЭффект золотой руны:@1^ffcb4a1-4 ур.: получение ци увеличивается до ^96f5ff0,2^ffcb4a5-7 ур.: получение ци увеличивается до ^96f5ff0,3^ffcb4a8-9 ур.: получение ци увеличивается до ^96f5ff0,4 ^ffcb4a10 ур.: получение ци увеличивается до ^96f5ff0,5@1@2^ffcb4aПолучение ци увеличивается до ^96f5ff0,%d^ffcb4a.@2"55950  "Великое сотрясание гор"55951  "^ff5c00Великое сотрясание гор^ffcb4aДальность: ^96f5ff22^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffАсураПеремещает союзника вперед на ^96f5ff25^ffffff м.В процессе перемещения персонаж неуязвим.^808080Действует только на членов отряда. Невозможно применить на себя.^00ff00Эффект изумрудной руны:@1Союзник получает иммунитет к негативным эффектам на некоторое время после перемещения.^00ff001-4 ур.: эффект действует ^96f5ff1^00ff00 сек.^00ff005-7 ур.: эффект действует ^96f5ff2^00ff00 сек.^00ff008-9 ур.: эффект действует ^96f5ff3^00ff00 сек. ^00ff0010 ур.: эффект действует ^96f5ff4^00ff00 сек.@1@2^00ff00Союзник получает иммунитет к негативным эффектам на ^96f5ff%d^00ff00 сек. после перемещения.@2"55960  "Великое сотрясание гор"55961  "^ff5c00Великое сотрясание гор^ffcb4aДальность: ^96f5ff22^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffАсураПеремещает союзника вперед на ^96f5ff25^ffffff м.В процессе перемещения персонаж неуязвим.^808080Действует только на членов отряда. Невозможно применить на себя.^00ffffЭффект сапфировой руны:@1На некоторое время увеличивает показатель защиты перемещаемого союзника на 20 ед.^00ffff1-4 ур.: увеличивает показатель защиты цели на ^ffffff4^00ffff сек.^00ffff5-7 ур.: увеличивает показатель защиты цели на ^ffffff6^00ffff сек.^00ffff8-9 ур.: увеличивает показатель защиты цели на ^ffffff8^00ffff сек. ^00ffff10 ур.: увеличивает показатель защиты цели на ^ffffff10^00ffff сек.@1@2В течение ^ffffff%d^00ffff сек. увеличивает показатель защиты перемещаемого союзника на 20 ед.@2"55970  "Великое сотрясание гор"55971  "^ff5c00Великое сотрясание гор^ffcb4aДальность: ^96f5ff22^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffАсураПеремещает союзника вперед на ^96f5ff25^ffffff м.В процессе перемещения персонаж неуязвим.^808080Действует только на членов отряда. Невозможно применить на себя.^ff0000Эффект рубиновой руны:@1На некоторое время увеличивает показатель атаки перемещаемого союзника на 20 ед.^ff00001-4 ур.: увеличивает показатель атаки цели на ^96f5ff4^ff0000 сек.^ff00005-7 ур.: увеличивает показатель атаки цели на ^96f5ff6^ff0000 сек.^ff00008-9 ур.: увеличивает показатель атаки цели на ^96f5ff8^ff0000 сек. ^ff000010 ур.: увеличивает показатель атаки цели на ^96f5ff10^ff0000 сек.@1@2В течение ^96f5ff%d^ff0000 сек. увеличивает показатель атаки перемещаемого союзника на 20 ед.@2"55980  "Великое сотрясание гор"55981  "^ff5c00Великое сотрясание гор^ffcb4aДальность: ^96f5ff22^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff120,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffАсураПеремещает союзника вперед на ^96f5ff25^ffffff м.В процессе перемещения персонаж неуязвим.^808080Действует только на членов отряда. Невозможно применить на себя.^ffeaabЭффект серебряной руны:@1Позволяет использовать умение дважды и сокращает время перезарядки.^ffeaab1-4 ур.: время перезарядки сокращается до ^96f5ff90^ffeaab сек.^ffeaab5-7 ур.: время перезарядки сокращается до ^96f5ff80^ffeaab сек.^ffeaab8-9 ур.: время перезарядки сокращается до ^96f5ff70^ffeaab сек. ^ffeaab10 ур.: время перезарядки сокращается до ^96f5ff60^ffeaab сек.@1@2Позволяет использовать умение дважды и сокращает время перезарядки до ^96f5ff%d^ffeaab сек.@2"56730  "Пламя пожара"56731  "^ffffffПламя пожара Уровень %d^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aСтатус: ^ffffffЗагадочныйСтрелок наделяет себя и всех союзников в радиусе ^96f5ff10^ffffff м аурой чистого пламени,которая добавляет к каждой атаке ^96f5ff%d%%^ffffff урона оружия в виде урона от стихии огня.Эффект действует ^96f5ff%d^ffffff мин."56740  "Светлое пламя пожара"56741  "^8080ffСветлое пламя пожара^ffcb4aМаг. энергия: ^96f5ff635^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aСтатус: ^ffffffБезупречныйСтрелок наделяет себя и всех союзников в радиусе ^96f5ff10^ffffff м аурой чистого пламени,которая добавляет к каждой атаке ^96f5ff40%%^ffffff урона оружия в виде урона от стихии огня.Эффект действует ^96f5ff%d^ffffff мин.^f7dfa5Время действия эффекта увеличено до ^96f5ff60^f7dfa5 мин."56750  "Темное пламя пожара"56751  "^8080ffТемное пламя пожара^ffcb4aМаг. энергия: ^96f5ff635^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aСтатус: ^ffffffБезупречныйСтрелок наделяет себя и всех союзников в радиусе ^96f5ff10^ffffff м аурой чистого пламени,которая добавляет к каждой атаке ^96f5ff40%%^ffffff урона оружия в виде урона от стихии огня.Эффект действует ^96f5ff%d^ffffff мин.^d618e7Урон от огня увеличивается до ^96f5ff50%%^d618e7 урона оружия."63800  "Великая линия огня"63801  "^ff5c00Великая линия огня^ffcb4aДальность: ^ffffffдальняя атака^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Храбрость^ffcb4aСтатус: ^ffffffМудрецПламя полыхает стеной, дым заполняет пространство. Стрелок поражает всех противников на линиишириной ^96f5ff5^ffffff м, нанося им урон стихией огня, равный базовому физическому урону, плюс ^96f5ff100%%^ffffff уронаоружия, плюс ^96f5ff3525^ffffff ед. Защита целей от стихии огня снижается на ^96f5ff60%%^ffffff на ^96f5ff15^ffffff сек.Каждое применение сокращает время перезарядки умения ^96f5ff'Великие девять солнц'^ffffff на ^96f5ff0,5^ffffff сек.^ffffffЭффект не распространяется на умение ^96f5ff'Великие девять солнц' с серебряной руной^ffffff."63810  "Великая линия огня"63811  "^ff5c00Великая линия огня^ffcb4aДальность: ^ffffffдальняя атака^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Храбрость^ffcb4aСтатус: ^ffffffМудрецПламя полыхает стеной, дым заполняет пространство. Стрелок поражает всех противников на линиишириной ^96f5ff5^ffffff м, нанося им урон стихией огня, равный базовому физическому урону, плюс ^96f5ff100%%^ffffff уронаоружия, плюс ^96f5ff3525^ffffff ед. Защита целей от стихии огня снижается на ^96f5ff60%%^ffffff на ^96f5ff15^ffffff сек.Каждое применение сокращает время перезарядки умения ^96f5ff'Великие девять солнц'^ffffff на ^96f5ff0,5^ffffff сек.^ffffffЭффект не распространяется на умение ^96f5ff'Великие девять солнц' с серебряной руной^ffffff.^ffcb4aЭффект золотой руны:@1^ffcb4a1-4 ур.: добавляется ^96f5ff40%%^ffcb4a урона оружия^ffcb4a5-7 ур.: добавляется ^96f5ff60%%^ffcb4a урона оружия^ffcb4a8-9 ур.: добавляется ^96f5ff80%%^ffcb4a урона оружия^ffcb4a 10 ур.: добавляется ^96f5ff100%%^ffcb4a урона оружия@1@2К наносимому урону добавляется ^96f5ff%d%%^ffcb4a урона оружия.@2"63820  "Великая линия огня"63821  "^ff5c00Великая линия огня^ffcb4aДальность: ^ffffffдальняя атака^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Храбрость^ffcb4aСтатус: ^ffffffМудрецПламя полыхает стеной, дым заполняет пространство. Стрелок поражает всех противников на линиишириной ^96f5ff5^ffffff м, нанося им урон стихией огня, равный базовому физическому урону, плюс ^96f5ff100%%^ffffff уронаоружия, плюс ^96f5ff3525^ffffff ед. Защита целей от стихии огня снижается на ^96f5ff60%%^ffffff на ^96f5ff15^ffffff сек.Каждое применение сокращает время перезарядки умения ^96f5ff'Великие девять солнц'^ffffff на ^96f5ff0,5^ffffff сек.^ffffffЭффект не распространяется на умение ^96f5ff'Великие девять солнц' с серебряной руной^ffffff.^00ff00Эффект изумрудной руны:@1Усиливается ^96f5ffблагословением танца пламени^00ff00 (^96f5ff[Великий танец пламени]^00ff00, руны ^88dd88●^00ff00 и ^ff0000●^00ff00).В этом статусе выстрел окажется критическим, а наносимый им урон увеличится.^00ff001-4 ур.: добавляется ^96f5ff40%%^00ff00 урона оружия^00ff005-7 ур.: добавляется ^96f5ff60%%^00ff00 урона оружия^00ff008-9 ур.: добавляется ^96f5ff80%%^00ff00 урона оружия ^00ff0010 ур.: добавляется ^96f5ff100%%^00ff00 урона оружия@1@2В сочетании с ^96f5ffблагословением танца пламени^00ff00 (^96f5ff[Великий танец пламени]^00ff00, руны ^88dd88●^00ff00 и ^ff0000●^00ff00)к урону добавляется ^96f5ff%d%%^00ff00 урона оружия, атака оказывается критической.@2"63830  "Великая линия огня"63831  "^ff5c00Великая линия огня^ffcb4aДальность: ^ffffffдальняя атака^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Храбрость^ffcb4aСтатус: ^ffffffМудрецПламя полыхает стеной, дым заполняет пространство. Стрелок поражает всех противников на линиишириной ^96f5ff5^ffffff м, нанося им урон стихией огня, равный базовому физическому урону, плюс ^96f5ff100%%^ffffff уронаоружия, плюс ^96f5ff3525^ffffff ед. Защита целей от стихии огня снижается на ^96f5ff60%%^ffffff на ^96f5ff15^ffffff сек.Каждое применение сокращает время перезарядки умения ^96f5ff'Великие девять солнц'^ffffff на ^96f5ff0,5^ffffff сек.^ffffffЭффект не распространяется на умение ^96f5ff'Великие девять солнц' с серебряной руной^ffffff.^00ffffЭффект сапфировой руны:@1^00ffff1-4 ур.: получение ци увеличивается до ^ffffff0,3^00ffff5-7 ур.: получение ци увеличивается до ^ffffff0,35^00ffff8-9 ур.: получение ци увеличивается до ^ffffff0,4^00ffff 10 ур.: получение ци увеличивается до ^ffffff0,45@1@2^00ffffПолучение ци увеличивается до ^ffffff0,%d^00ffff.@2"63840  "Великая линия огня"63841  "^ff5c00Великая линия огня^ffcb4aДальность: ^ffffffдальняя атака^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Храбрость^ffcb4aСтатус: ^ffffffМудрецПламя полыхает стеной, дым заполняет пространство. Стрелок поражает всех противников на линиишириной ^96f5ff5^ffffff м, нанося им урон стихией огня, равный базовому физическому урону, плюс ^96f5ff100%%^ffffff уронаоружия, плюс ^96f5ff3525^ffffff ед. Защита целей от стихии огня снижается на ^96f5ff60%%^ffffff на ^96f5ff15^ffffff сек.Каждое применение сокращает время перезарядки умения ^96f5ff'Великие девять солнц'^ffffff на ^96f5ff0,5^ffffff сек.^ffffffЭффект не распространяется на умение ^96f5ff'Великие девять солнц' с серебряной руной^ffffff.^ff0000Эффект рубиновой руны:@1^ff00001-4 ур.: защита от огня снижается на ^96f5ff65%%^ff0000^ff00005-7 ур.: защита от огня снижается на ^96f5ff70%%^ff0000^ff00008-9 ур.: защита от огня снижается на ^96f5ff75%%^ff0000^ff0000 10 ур.: защита от огня снижается на ^96f5ff80%%^ff0000@1@2^ff0000Защита целей от стихии огня снижается на ^96f5ff%d%%^ff0000.@2"63850  "Великая линия огня"63851  "^ff5c00Великая линия огня^ffcb4aДальность: ^ffffffдальняя атака^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffручная пушка^ffcb4aХарактеристика: ^ff5c00Храбрость^ffcb4aСтатус: ^ffffffМудрецПламя полыхает стеной, дым заполняет пространство. Стрелок поражает всех противников на линиишириной ^96f5ff5^ffffff м, нанося им урон стихией огня, равный базовому физическому урону, плюс ^96f5ff100%%^ffffff уронаоружия, плюс ^96f5ff3525^ffffff ед. Защита целей от стихии огня снижается на ^96f5ff60%%^ffffff на ^96f5ff15^ffffff сек.Каждое применение сокращает время перезарядки умения ^96f5ff'Великие девять солнц'^ffffff на ^96f5ff0,5^ffffff сек.^ffffffЭффект не распространяется на умение ^96f5ff'Великие девять солнц' с серебряной руной^ffffff.^ffeaabЭффект серебряной руны:@1Позволяет использовать умение дважды и наносит дополнительный урон.^ffeaab1-4 ур.: добавляется ^96f5ff32%%^ffeaab урона оружия^ffeaab5-7 ур.: добавляется ^96f5ff48%%^ffeaab урона оружия^ffeaab8-9 ур.: добавляется ^96f5ff64%%^ffeaab урона оружия^ffeaab 10 ур.: добавляется ^96f5ff80%%^ffeaab урона оружия@1@2^ffeaabПозволяет использовать умение дважды и дополнительно наносит ^96f5ff%d%%^ffeaab урона оружия.@2"*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL5087 
#define __CPPGEN_GNET_SKILL5087 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill5087:public Skill 
    { 
    public: 
        enum { SKILL_ID = 5087 }; 
        Skill5087 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill5087Stub:public SkillStub 
    { 
    public: 
#ifdef _SKILL_SERVER 
    class State1:public SkillStub::State 
    { 
    public: 
        int GetTime (Skill * skill) const { return 0; } 
        bool Quit (Skill * skill) const { return false; } 
        bool Loop (Skill * skill) const { return false; } 
        bool Bypass (Skill * skill) const { return false; } 
        void Calculate (Skill * skill) const 
        { 
            static int aarray[10] = { 210,210,210,210,210,210,210,210,210,210 }; 
            skill->GetPlayer ()->SetDecmp (aarray[skill->GetLevel () - 1]); 
            skill->GetPlayer ()->SetPerform (1); 
            return; 
        } 
        bool Interrupt (Skill * skill) const { return false; } 
        bool Cancel (Skill * skill) const { return 1; } 
        bool Skip (Skill * skill) const { return 0; } 
    }; 
#endif 
    Skill5087Stub ():SkillStub (5087) 
    { 
        cls                 = 12; 
#ifdef _SKILL_CLIENT 
        name                = L"��ȵ����"; 
        nativename          = "��ȵ����"; 
        icon                = "����������.dds"; 
#endif 
        max_level           = 1; 
        type                = 2; 
        allow_ride          = 0; 
        attr                = 1; 
        rank                = 0; 
        eventflag           = 0; 
        is_senior           = 0; 
        is_inherent         = 1; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 2904; 
        allow_forms         = 1; 
        apcost              = 0; 
        apgain              = 0; 
        doenchant           = 1; 
        dobless             = 1; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 1; 
        time_type           = 1; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 5060; 
        combosk_interval    = 10000; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = ""; 
        aerial_effect       = ""; 
#endif 
        range.type          = 5; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 1303; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(0, 1)); 
        restrict_weapons.push_back (59831); 
#ifdef _SKILL_SERVER 
        statestub.push_back (new State1 ()); 
#endif 
    } 
    int GetExecutetime (Skill * skill) const 
    { 
        static int aarray[10] = { 500,500,500,500,500,500,500,500,500,500 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 1000,1000,1000,1000,1000,1000,1000,1000,1000,1000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 1500000,1500000,1500000,1500000,1500000,1500000,1500000,1500000,1500000,1500000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 100,100,100,100,100,100,100,100,100,100 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 1500000,1500000,1500000,1500000,1500000,1500000,1500000,1500000,1500000,1500000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    float GetRadius (Skill * skill) const 
    { 
        return (float) (0); 
    } 
    float GetAttackdistance (Skill * skill) const 
    { 
        return (float) (0); 
    } 
    float GetAngle (Skill * skill) const 
    { 
        return (float) (0); 
    } 
    float GetPraydistance (Skill * skill) const 
    { 
        static float aarray[10] = { 0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 210,210,210,210,210,210,210,210,210,210 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
    int GetIntroduction (Skill * skill, const wchar_t * buffer, int length, const wchar_t * format) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    int GetEnmity (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool StateAttack (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool BlessMe (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetEffectdistance (Skill * skill) const 
    { 
        return 5; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    int GetAttackspeed (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool TakeEffect (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetHitrate (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
