//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
18340  "Загнанный зверь"18341  "^ffff00Загнанный зверь^ffcb4aМаг. энергия: ^96f5ff252^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff2,3^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff300^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБлагочестивыйЕсли оборотень в течение ^96f5ff150^ffffff сек. получит смертельный удар, он восстановит^96f5ff45%%^ffffff максимального здоровья, получит ^96f5ff2^ffffff ци и избавится от негативных эффектов.^ffcb4aМожно применить в облике тигра и панды."18770  "Сбитый дракон"18771  "^ffff00Сбитый дракон^ffcb4aДальность: ^96f5ff35^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff240^ffffff^ffcb4aПодготовка: ^ffffff0,6^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff60,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБлагочестивыйНаносит всем противникам в радиусе ^96f5ff20^ffffff м ^96f5ff40%%^ffffff базового физического урона.Летящим противникам наносит ^96f5ffтройной^ffffff урон и с некоторой вероятностьюсбивает их на землю, после чего они не могут взлететь в течение ^96f5ff30^ffffff сек.Результат зависит от уровня и силы духа: при равном уровне шанс успеха составляет от ^96f5ff50%%^ffffff до ^96f5ff90%%^ffffff,при равной силе духа - ^96f5ff70%%^ffffff.Не промахивается.Не действует на противников, чей уровень превышает ваш на 5 и более.^a6caf0Навык нельзя применить в полете.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци."19800  "Светлый облик тигра (усиленное)"19801  "^8080ffСветлый облик тигра^96f5ffУсиленное^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff2,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffБезупречныйОборотень принимает облик белого тигра.Максимальный запас здоровья увеличивается на ^96f5ff40%%^ffffff, а скорость передвижения - на ^96f5ff%d%% ^ffffff.^a6caf0Общее время перезарядки с 'Обликом панды'.^f7dfa5При каждом запуске приносит ^96f5ff0,2^f7dfa5 ци."19810  "Темный облик тигра (усиленное)"19811  "^8080ffТемный облик тигра^96f5ffУсиленное^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff2,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffДемонОборотень принимает облик белого тигра.Максимальный запас здоровья увеличивается на ^96f5ff30%%^ffffff, а скорость передвижения - на ^96f5ff%d%% ^ffffff.^a6caf0Общее время перезарядки с 'Обликом панды'.^d618e7В первые ^96f5ff6^d618e7 сек. после активации вероятность получения критического удара уменьшается на ^96f5ff5%%^d618e7."19820  "Светлый облик панды"19821  "^8080ffСветлый облик панды^96f5ffУсиленное^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff2,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffБезупречныйОборотень превращается в солнечную панду.Максимальный запас здоровья увеличивается на ^96f5ff40%%^ffffff, а скорость передвижения - на ^96f5ff%d%%^ffffff.^a6caf0Общее время перезарядки с 'Обликом тигра'.^f7dfa5При каждом использовании приносит ^96f5ff0,2^f7dfa5 ци."19830  "Темный облик панды"19831  "^8080ffТемный облик панды^96f5ffУсиленное^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff2,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffДемонОборотень превращается в солнечную панду.Максимальный запас здоровья увеличивается на ^96f5ff30%%^ffffff, а скорость передвижения - на ^96f5ff%d%%^ffffff.^a6caf0Общее время перезарядки с 'Обликом тигра'.^d618e7В первые ^96f5ff6^d618e7 сек. после активации вероятность получения критического удара уменьшается на ^96f5ff5%%^d618e7."22440  "Божественный тысячетонный молот"22441  "^ffff00Божественный тысячетонный молот^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,9^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБезупречныйРазмашистый удар, сокрушающий противника.Наносит базовый физический урон плюс ^96f5ff3836^ffffff ед. физического урона.С вероятностью ^96f5ff50%%^ffffff парализует противника на ^96f5ff4^ffffff сек.Если парализовать не удается, обездвиживает цель на ^96f5ff3^ffffff сек.Не промахивается.^f7dfa5Время перезарядки сокращается на ^96f5ff1^f7dfa5 сек."22450  "Демонический тысячетонный молот"22451  "^ffff00Демонический тысячетонный молот^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,9^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДемонРазмашистый удар, сокрушающий противника.Наносит базовый физический урон плюс ^96f5ff3836^ffffff ед. физического урона.С вероятностью ^96f5ff50%%^ffffff парализует противника на ^96f5ff4^ffffff сек.Если парализовать не удается, обездвиживает цель на ^96f5ff3^ffffff сек.Не промахивается.^d618e7Вероятность парализовать цель увеличивается до ^96f5ff60%%^d618e7."22460  "Пустота"22461  "^ffff00Милость бога зверей^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,7^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,8^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff2^ffcb4a мин^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБлагочестивыйНет"22470  "Божественное разверзшееся небо"22471  "^ffff00Божественное разверзшееся небо^ffcb4aПерсонаж должен быть в образе тигра или панды^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,7^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff30,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffПросвещенныйСотрясая само небо, оборотень атакует всех противников в радиусе ^96f5ff12^ffffff м,наносит им базовый физический урон плюс ^96f5ff300%%^ffffff урона оружияи оставляет кровоточащие раны, которые в течение ^96f5ff9^ffffff сек. причиняют еще ^96f5ff33415^ffffff ед. урона.Восстанавливает оборотню ^96f5ff%d^ffffff ед. ЖС за ^96f5ff9^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^f7dfa5Восстанавливает до ^96f5ff8500^f7dfa5 ед. здоровья."22480  "Демоническое разверзшееся небо"22481  "^ffff00Демоническое разверзшееся небо^ffcb4aПерсонаж должен быть в образе тигра или панды^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,7^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff30,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffДух злаСотрясая само небо, оборотень атакует всех противников в радиусе ^96f5ff12^ffffff м,наносит им базовый физический урон плюс ^96f5ff300%%^ffffff урона оружияи оставляет кровоточащие раны, которые в течение ^96f5ff9^ffffff сек. причиняют еще ^96f5ff33415^ffffff ед. урона.Восстанавливает оборотню ^96f5ff%d^ffffff ед. ЖС за ^96f5ff9^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^d618e7Восстанавливает лишь ^96f5ff4000^d618e7 ед. здоровья, но на ^96f5ff5^d618e7 сек. все удары становятся критическими."24180  "Божественный звериный молот"24181  "^ffff00Божественный звериный молот^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,7^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff3,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБезупречныйПрямой мощный удар, наносящий базовый физический урон плюс ^96f5ff5266^ffffff ед.Если цель - игрок, в течение ^96f5ff6^ffffff сек. она будет получать на ^96f5ff8%%^ffffff больше урона от навыков.Эффект увеличения урона суммируется до ^96f5ff5^ffffff раз, время действия при этом обновляется.^f7dfa5Получение ци увеличивается до ^96f5ff0,15^f7dfa5 ци."24190  "Демонический звериный молот"24191  "^ffff00Демонический звериный молот^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,7^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff3,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДемонПрямой мощный удар, наносящий базовый физический урон плюс ^96f5ff5266^ffffff ед.Если цель - игрок, в течение ^96f5ff6^ffffff сек. она будет получать на ^96f5ff8%%^ffffff больше урона от навыков.Эффект увеличения урона суммируется до ^96f5ff5^ffffff раз, время действия при этом обновляется.^d618e7Не промахивается."24200  "Божественный вызов"24201  "^ffff00Божественный вызов^ffcb4aДальность: ^96f5ff%d^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,1^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff8,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБезупречныйСобрав волю в кулак, оборотень бросается на противника с расстояния до ^96f5ff12^ffffff м.Удар наносит базовый урон, плюс ^96f5ff100%%^ffffff физического урона оружия, плюс ^96f5ff5516^ffffff ед. физического уронаи снижает способность цели к уклонению на ^96f5ff50%%^ffffff на ^96f5ff8^ffffff сек.^f7dfa5Не промахивается.^f7dfa5Применение навыка ^96f5ff'Божественный звериный молот'^f7dfa5 или ^96f5ff'Великий звериный молот'^f7dfa5 в течение ^96f5ff6^f7dfa5 сек. наносит критический урон."24210  "Демонический вызов"24211  "^ffff00Демонический вызов^ffcb4aДальность: ^96f5ff%d^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,1^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff8,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДемонСобрав волю в кулак, оборотень бросается на противника с расстояния до ^96f5ff12^ffffff м.Удар наносит базовый урон, плюс ^96f5ff100%%^ffffff физического урона от оружия, плюс ^96f5ff5516^ffffff ед. физического уронаи снижает способность цели к уклонению на ^96f5ff50%%^ffffff на ^96f5ff8^ffffff сек.^d618e7На ^96f5ff6^d618e7 сек. повышает шанс критического удара на ^96f5ff40%%^d618e7."32060  "Божественный яростный укус"32061  "^ffff00Божественный яростный укус^ffcb4aПерсонаж должен быть в образе тигра или панды^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffБезупречныйОборотень рвет противника когтями и клыками, нанося ему кровоточащие раныи вынуждая его сосредоточить все внимание на себе.Атака наносит противнику базовый физ. урон плюс ^96f5ff10549^ffffff ед. физ. урона,^ffffffа кровотечение - наносит дополнительный базовый физ. урон в течение ^96f5ff15^ffffff сек.Не промахивается.^a6caf0Дополнительная стоимость: ^ffffff0,2^a6caf0 ци.^f7dfa5Требует всего ^96f5ff0,15^f7dfa5 ци."32070  "Демонический яростный укус"32071  "^ffff00Демонический яростный укус^ffcb4aПерсонаж должен быть в образе тигра или панды^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffДемонОборотень рвет противника когтями и клыками, нанося ему кровоточащие раныи вынуждая его сосредоточить все внимание на себе.Атака наносит противнику базовый физ. урон плюс ^96f5ff10549^ffffff ед. физ. урона,^ffffffа кровотечение - наносит дополнительный базовый физ. урон в течение ^96f5ff15^ffffff сек.Не промахивается.^a6caf0Дополнительная стоимость: ^ffffff0,2^a6caf0 ци.^d618e7Время перезарядки уменьшается на ^96f5ff0,5^d618e7 сек."32080  "Божественное неистовство зверя"32081  "^ffff00Божественное неистовство зверя^ffcb4aМаг. энергия: ^96f5ff50^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff30,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffБезупречныйВ течение ^96f5ff15^ffffff сек. каждый полученный удар приносит оборотню ^96f5ff0,12^ffffff ци. Если на момент активации уменияу оборотня осталось менее ^96f5ff50%%^ffffff ЖС, появится щит, способный поглотить до ^96f5ff50%%^ffffff магического урона. Щит действует не дольше ^96f5ff10^ffffff сек.^f7dfa5Время действия щита увеличивается до ^96f5ff20^f7dfa5 сек."32090  "Демоническое неистовство зверя"32091  "^ffff00Демоническое неистовство зверя^ffcb4aМаг. энергия: ^96f5ff50^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff30 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aСтатус: ^ffffffДемонВ течение ^96f5ff15^ffffff сек. каждый полученный удар приносит оборотню ^96f5ff0,12^ffffff ци. Если на момент активации уменияу оборотня осталось менее ^96f5ff50%%^ffffff ЖС, появится щит, способный поглотить до ^96f5ff50%%^ffffff магического урона. Щит действует не дольше ^96f5ff10^ffffff сек.^d618e7Каждый раз, когда персонаж подвергается атаке, можно дополнительно получить ^96f5ff0,08^d618e7 ци."32100  "Божественная раскалывающаяся земля"32101  "^ffff00Божественная раскалывающаяся земля^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБезупречныйОборотень подпрыгивает и обрушивается на землю, создавая мощную волну.Все противники в радиусе ^96f5ff10^ffffff м. получают базовый физический урон плюс^96f5ff60%%^ffffff урона оружия плюс ^96f5ff9373^ffffff ед. физ. урона.Монстры отбрасываются на ^96f5ff9^ffffff м.На некоторое время снижает силу атаки противников на ^96f5ff100%%^ffffff.^f7dfa5Время перезарядки уменьшается на ^96f5ff2^f7dfa5 сек."32110  "Демоническая раскалывающаяся земля"32111  "^ffff00Демоническая раскалывающаяся земля^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДемонОборотень подпрыгивает и обрушивается на землю, создавая мощную волну.Все противники в радиусе ^96f5ff10^ffffff м. получают базовый физический урон плюс^96f5ff60%%^ffffff урона оружия плюс ^96f5ff9373^ffffff ед. физ. урона.Монстры отбрасываются на ^96f5ff9^ffffff м.На некоторое время снижает силу атаки противников на ^96f5ff100%%^ffffff.^d618e7Дополнительно приносит ^96f5ff0,18^d618e7 ци."32120  "Гнев хищника"32121  "^ff0000Гнев хищника Ур. %d|if&dynskilllv()>0&^ffcb4a +%d&|^ffcb4aПерсонаж должен быть в образе тигра или панды^ffcb4aДальность: ^ffffffближний бой^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff300 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, без оружия^ffcb4aРасходуемые предметы: ^96f5ffЖивая душа^ffffff^ffcb4aСтатус: ^ffffffБлагочестивыйКаждые ^96f5ff3^ffffff сек. враги в радиусе ^96f5ff12^ffffff м от персонажа подвергаются атаке,в общей сложности производится ^96f5ff5^ffffff атак.Каждая атака наносит базовый физ. урон плюс ^96f5ff300%%^ffffff урона оружияплюс ^96f5ff50%%^ffffff от максимального запаса здоровья плюс ^96f5ff9545^ffffff ед. физ. урона.С вероятностью ^96f5ff|if&(skilllv()+dynskilllv())<2&50&100|%%^ffffff противник будет парализован на ^96f5ff2^ffffff сек.Дает иммунитет к эффектам, ограничивающим передвижение, на ^96f5ff15^ffffff сек.При каждой атаке расходуется ^96f5ff10%%^ffffff текущего здоровья и маг. энергии.^96f5ffЕсли запас маг. энергии снизится до 200, действие умения будет прервано.|if&(skilllv()+dynskilllv())>2&^ffffffУр. 3: Число атак увеличивается до ^96f5ff8^ffffff, каждая атака подбрасывает врагов на ^96f5ff2^ffffff сек.Дает иммунитет к негативным эффектам на ^96f5ff24^ffffff сек.&^808080Ур. 3: Число атак увеличивается до 8, каждая подбрасывает врагов на 2 сек.Дает иммунитет к негативным эффектам на 24 сек."*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL834 
#define __CPPGEN_GNET_SKILL834 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill834:public Skill 
    { 
    public: 
        enum { SKILL_ID = 834 }; 
        Skill834 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill834Stub:public SkillStub 
    { 
    public: 
#ifdef _SKILL_SERVER 
        class State1:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 800;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetPray (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State2:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 400;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->SetRatio (-1 + 1 * skill->GetLevel ());
                skill->SetDamage (skill->GetAttack ());
                skill->GetPlayer ()->SetPerform (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State3:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 0;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
    Skill834Stub ():SkillStub (834) 
    { 
        cls                 = 127; 
#ifdef _SKILL_CLIENT 
        name                = L"�ƻ��¼ӵ��幥��"; 
        nativename          = "�ƻ��¼ӵ��幥��"; 
        icon                = ""; 
#endif 
        max_level           = 10; 
        type                = 1; 
        allow_ride          = 0; 
        attr                = 6; 
        rank                = 0; 
        eventflag           = 0; 
        is_senior           = 0; 
        is_inherent         = 0; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 0; 
        allow_forms         = 0; 
        apcost              = 0; 
        apgain              = 0; 
        doenchant           = 0; 
        dobless             = 0; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 0; 
        time_type           = 0; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 0; 
        combosk_interval    = 0; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = "���������������ܹ���.sgc"; 
        aerial_effect       = ""; 
#endif 
        range.type          = 0; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 0; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(0, 1)); 
#ifdef _SKILL_SERVER 
        statestub.push_back (new State1 ()); 
        statestub.push_back (new State2 ()); 
        statestub.push_back (new State3 ()); 
#endif 
    } 
        int GetExecutetime (Skill * skill) const
        {
            return 400;
        }
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
        float GetRadius (Skill * skill) const
        {
            return (float) (12);
        }
        float GetAttackdistance (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAngle (Skill * skill) const
        {
            return (float) (1 - 0.0111111 * (0));
        }
        float GetPraydistance (Skill * skill) const
        {
            return (float) (20);
        }
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
        int GetIntroduction (Skill * skill, wchar_t * buffer, int length, wchar_t * format) const
        {
            return _snwprintf (buffer, length, format);
        }
#endif 
#ifdef _SKILL_SERVER 
        int GetEnmity (Skill * skill) const
        {
            return 0;
        }
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool StateAttack (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool BlessMe (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        float GetEffectdistance (Skill * skill) const
        {
            return (float) (45);
        }
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    int GetAttackspeed (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool TakeEffect (Skill * skill) const
        {;
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetHitrate (Skill * skill) const
        {
            return (float) (1.0);
        }
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
