//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
2270  "Высшая вспышка ци"2271  "^ffffffВысшая вспышка ци^ffcb4aСтатус: ^ffffffЗлойСжигая ци, персонаж получает 10%% от максимального запаса ЖСи повышает силу своей физической атаки на 300%% урона оружия на 12 сек.Кроме того, в течение 2 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff2^a6caf0 ци."3620  "Вспышка бессмертного"3621  "^ffffffВспышка бессмертного^ffcb4aСтатус: ^ffffffБезупречныйСжигая ци, персонаж получает 20%% от максимального запаса ЖС,и повышает силу своей физической атаки на 500%% урона оружия,а также снижает получаемый урон на 25%% на 15 сек.Кроме того, в течение 3 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff3^a6caf0 ци."3630  "Вспышка демона"3631  "^ffffffВспышка демона^ffcb4aСтатус: ^ffffffДемонСжигая ци, персонаж получает 20%% от максимального запаса ЖС,и повышает силу своей физической атаки на 500%% урона оружия,а скорость атаки на 25%% на 15 сек.Кроме того, в течение 3 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff3^a6caf0 ци."3740  "Светлый удар тигра"3741  "^8080ffСветлый удар тигра^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйЭнергичный удар, наносящий противнику базовый физический уронплюс ^96f5ff%d^ffffff ед. дополнительного урона.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 приносит ^96f5ff0,2^f7dfa5 ци."3750  "Темный удар тигра"3751  "^8080ffТемный удар тигра^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонЭнергичный удар, наносящий противнику базовый физический уронплюс ^96f5ff%d^ffffff ед. дополнительного урона.^d618e7Время подготовки и применения сокращается на ^96f5ff0,1^d618e7 сек."3760  "Светлый глубокий порез"3761  "^8080ffСветлый глубокий порез^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйТочный удар, оставляющий глубокую открытую рану.Наносит противнику базовый физический урон и вызывает кровотечение,которое в течение ^96f5ff9^ffffff сек. наносит еще ^96f5ff%d^ffffff ед. физического урона.^f7dfa5Урон от кровотечения увеличивается на ^96f5ff30%%^f7dfa5."3770  "Темный глубокий порез"3771  "^8080ffТемный глубокий порез^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонТочный удар, оставляющий глубокую открытую рану.Наносит противнику базовый физический урон и вызывает кровотечение,которое в течение ^96f5ff9^ffffff сек. наносит еще ^96f5ff%d^ffffff ед. физического урона.^d618e7Время кровотечения сокращается на ^96f5ff3^d618e7 сек."3780  "Светлое вздымающееся море"3781  "^8080ffСветлое вздымающееся море^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйМощная атака, увеличивающая уровень агрессии.Наносит базовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^f7dfa5Затраты ци снижены на ^96f5ff0,1^f7dfa5."3790  "Темное вздымающееся море"3791  "^8080ffТемное вздымающееся море^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонМощная атака, увеличивающая уровень агрессии.Наносит базовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^d618e7При попадании с вероятностью ^96f5ff25%%^d618e7 восстанавливает ^96f5ff800^d618e7 ед. здоровья."3800  "Светлый зарождающийся шторм"3801  "^8080ffСветлый зарождающийся шторм^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСокрушительный удар наносит противнику базовыйфизический урон, плюс ^96f5ff120%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физического урона.С вероятностью ^96f5ff50%%^ffffff оглушает противника на ^96f5ff3^ffffff сек.^f7dfa5Урон от оружия увеличивается до ^96f5ff180%%^f7dfa5."3810  "Темный зарождающийся шторм"3811  "^8080ffТемный зарождающийся шторм^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонСокрушительный удар наносит противнику базовыйфизический урон, плюс ^96f5ff120%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физического урона. С вероятностью ^96f5ff50%%^ffffff оглушает противника на ^96f5ff3^ffffff сек.^d618e7Время перезарядки сокращается на ^96f5ff1^d618e7 сек."3820  "Светлый стремительный дракон"3821  "^8080ffСветлый стремительный дракон^ffcb4aДальность: ^96f5ff%d^ffffff ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСоздает стремительное лезвие из света, которое наноситбазовый физический урон плюс ^96f5ff%d^ffffff ед. физ. урона^f7dfa5Время перезарядки сокращается на 1^f7dfa5 сек."3830  "Темный стремительный дракон"3831  "^8080ffТемный стремительный дракон^ffcb4aДальность: ^96f5ff%d^ffffff ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонСоздает стремительное лезвие из света, которое наноситбазовый физический урон плюс ^96f5ff%d^ffffff ед. физ. урона.^d618e7Дальность атаки увеличивается на ^96f5ff2^d618e7 м."3840  "Светлая расколотая гора"3841  "^8080ffСветлая расколотая гора^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffПросвещенныйВоин наполняет оружие энергией и обрушивает его на противника, наносябазовый физический урон, плюс ^96f5ff%d^ffffff ед. физического урона.Скорость противника уменьшается на ^96f5ff%d%%^ffffff на ^96f5ff10^ffffff сек.^f7dfa5С вероятностью ^96f5ff20%%^f7dfa5 обездвиживает противника на ^96f5ff3^f7dfa5 сек."3850  "Темная расколотая гора"3851  "^8080ffТемная расколотая гора^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДух злаВоин наполняет оружие энергией и обрушивает его на противника, наносябазовый физический урон, плюс ^96f5ff%d^ffffff ед. физического урона.Скорость противника уменьшается на ^96f5ff%d%%^ffffff на ^96f5ff10^ffffff сек.^d618e7Дополнительный урон увеличивается на ^96f5ff800^d618e7 ед."3860  "Светлый яростный дракон"3861  "^8080ffСветлый яростный дракон^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСтрашный удар наносит всем противникам перед собойбазовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.^f7dfa5Время перезарядки сокращается на ^96f5ff2^f7dfa5 сек."3870  "Темный яростный дракон"3871  "^8080ffТемный яростный дракон^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонСтрашный удар наносит всем противникам перед собойбазовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.^d618e7Радиус действия увеличивается в ^96f5ff2^d618e7 раза."3880  "Светлые разделяющие удары"3881  "^8080ffСветлые разделяющие удары^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,9 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйКруговая атака, наносящая врагам в радиусе ^96f5ff8^ffffff м.базовый физический урон плюс ^96f5ff%d^ffffff ед. физ. урона.^f7dfa5Дополнительный урон увеличивается на ^96f5ff500^f7dfa5 ед."3890  "Темные разделяющие удары"3891  "^8080ffТемные разделяющие удары^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,9 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонКруговая атака, наносящая врагам в радиусе ^96f5ff8^ffffff м.базовый физический урон плюс ^96f5ff%d^ffffff ед. физ. урона.^d618e7С вероятностью ^96f5ff20%%^d618e7 приносит ^96f5ff0,3^d618e7 ци."3900  "Светлое расколотое небо"3901  "^8080ffСветлое расколотое небо^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffПросвещенныйМощный удар двумя кулаками наносит базовый физический урон плюс ^96f5ff%d^ffffff ед. физ. урона. Замедляет противника на ^96f5ff%d%%^ffffff на ^96f5ff8^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 не затратит ци."3910  "Темное расколотое небо"3911  "^8080ffТемное расколотое небо^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffДух злаМощный удар двумя кулаками наносит базовый физический урон плюс ^96f5ff%d^ffffff ед. физ. урона. Замедляет противника на ^96f5ff%d%%^ffffff на ^96f5ff8^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Длительность замедления увеличивается на ^96f5ff2^d618e7 сек."3920  "Светлый удар без тени"3921  "^8080ffСветлый удар без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,08^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffБезупречныйМолниеносный удар, наносящийбазовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.Прерывает применение умений.^f7dfa5Время перезарядки сокращается на ^96f5ff2^f7dfa5 сек."3930  "Темный удар без тени"3931  "^8080ffТемный удар без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,08^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffДемонМолниеносный удар, наносящий базовыйфизический урон плюс ^96f5ff%d^ffffff ед. физического урона.Прерывает применение умений.^d618e7Задевает всех противников в радиусе ^96f5ff3^d618e7 м от цели."3940  "Светлое очищение небес"3941  "^8080ffСветлое очищение небес^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffПросвещенныйКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м.базовый физический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%d^ffffff ед. физического урона. На ^96f5ff%d^ffffff сек. повышаетскорость атаки персонажа на ^96f5ff%d%%^ffffff.^f7dfa5Время ускорения атаки увеличивается на ^96f5ff5^f7dfa5 сек."3950  "Темное очищение небес"3951  "^8080ffТемное очищение небес^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffДух злаКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м.базовый физический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%d^ffffff ед. физического урона. На ^96f5ff%d^ffffff сек. повышаетскорость атаки персонажа на ^96f5ff%d%%^ffffff.^d618e7Скорость атаки увеличивается до ^96f5ff20%%^d618e7."3960  "Светлый удар дракона"3961  "^8080ffСветлый удар дракона^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffПросвещенныйСобрав энергию в ладонях, персонаж наносит прямой удар по противникам, стоящим на расстояниидо ^96f5ff15^ffffff м., причиняя им базовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff8504^ffffff ед. физ. урона.На ближайшие ^96f5ff15^ffffff сек. добавляет к физической атаке ^96f5ff100%%^ffffff урона стихией огня.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^f7dfa5Противники в течение ^96f5ff9^f7dfa5 сек. получают ^96f5ff3000^f7dfa5 ед. урона стихией огня."3970  "Темный удар дракона"3971  "^8080ffТемный удар дракона^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffбез оружия, кастеты^ffcb4aСтатус: ^ffffffДух злаСобрав энергию в ладонях, персонаж наносит прямой удар по противникам, стоящим на расстояниидо ^96f5ff15^ffffff м., причиняя им базовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff8504^ffffff ед. физ. урона.На ближайшие ^96f5ff15^ffffff сек. добавляет к физической атаке ^96f5ff100%%^ffffff урона стихией огня.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^d618e7Дополнительный урон от огня увеличивается до ^96f5ff135%%^d618e7."3980  "Светлая буря шипов"3981  "^8080ffСветлая буря шипов^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffБезупречныйПоражает всех противников по прямой линии на расстоянии до ^96f5ff12^ffffff м,нанося базовый физический урон плюс ^96f5ff4863^ffffff ед. физического урона.Вызывает кровотечение, которое в течение ^96f5ff6^ffffff сек. наносит еще^96f5ff300%%^ffffff урона оружия и ^96f5ff4863^ffffff ед. физического урона.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 не затратит ци."3990  "Темная буря шипов"3991  "^8080ffТемная буря шипов^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffДемонПоражает всех противников по прямой линии на расстоянии до ^96f5ff12^ffffff м,нанося им базовый физический урон плюс ^96f5ff4863^ffffff ед. физического урона.Вызывает кровотечение, которое в течение ^96f5ff6^ffffff сек. наносит еще^96f5ff300%%^ffffff урона оружия и ^96f5ff4863^ffffff ед. физического урона.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Дальность действия увеличивается на ^96f5ff50%%^d618e7."4000  "Светлая самозарядная пушка"4001  "^8080ffСветлая самозарядная пушка^ffcb4aДальность: ^96f5ff%d^ffffff ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffБезупречныйВнезапный удар по стоящему в отдалении противнику.Наносит базовый физический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физ. урона.^f7dfa5Урон оружия увеличивается на ^96f5ff50%%^f7dfa5, дополнительный урон - на ^96f5ff800^f7dfa5 ед."4010  "Темная самозарядная пушка"4011  "^8080ffТемная самозарядная пушка^ffcb4aДальность: ^96f5ff%d^ffffff ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffДемонВнезапный удар по стоящему в отдалении противнику.Наносит базовый физический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физ. урона^d618e7Дальность атаки увеличивается до ^96f5ff18^d618e7 м."4020  "Светлые падающие звезды"4021  "^8080ffСветлые падающие звезды^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffБезупречныйОружие воина излучает свет, поражая врагов на расстоянии до ^96f5ff15^ffffff м.Наносит базовый физический урон плюс ^96f5ff3912^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff18^ffffff м.^f7dfa5При попадании прерывает применение умений."4030  "Темные падающие звезды"4031  "^8080ffТемные падающие звезды^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffДемонОружие воина излучает свет, поражая врагов на расстоянии до ^96f5ff15^ffffff м.Наносит базовый физический урон плюс ^96f5ff3912^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff18^ffffff м.^d618e7С вероятностью ^96f5ff33%%^d618e7 оглушает ближайших противников на ^96f5ff5^d618e7 сек."4040  "Светлое морозное сияние"4041  "^8080ffСветлое морозное сияние^ffcb4aДальность: ^96f5ff20^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffПросвещенныйВоин ударяет по земле, поражая всех противников в радиусе ^96f5ff12^ffffff м от цели. Наноситбазовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff8504^ffffff ед. физ. урона.Если расстояние до противников меньше ^96f5ff10^ffffff м, снижает их физическую и магическую защиту на ^96f5ff%d%%^ffffff на ^96f5ff10^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^f7dfa5С вероятностью ^96f5ff50%%^f7dfa5 потратит только 1 ци.^f7dfa5Физическая защита игроков снижается на ^96f5ff90%%^f7dfa5, ^f7dfa5а магическая - на ^96f5ff60%%^f7dfa5."4050  "Темное морозное сияние"4051  "^8080ffТемное морозное сияние^ffcb4aДальность: ^96f5ff20^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffДух злаВоин ударяет по земле, поражая всех противников в радиусе ^96f5ff12^ffffff м от цели. Наноситбазовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff8504^ffffff ед. физ. урона.Если расстояние до противников меньше ^96f5ff10^ffffff м, снижает их физическую и магическую защиту на ^96f5ff%d%%^ffffff на ^96f5ff10^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^d618e7Если расстояние до противников больше ^96f5ff10^d618e7 м, замораживает их на ^96f5ff2^d618e7 сек.^d618e7Если противник - игрок, то снижает физическую защиту противников на ^96f5ff90%%^d618e7, ^d618e7а магическую - на ^96f5ff60%%^d618e7."4060  "Светлый летящий дракон"4061  "^8080ffСветлый летящий дракон^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБезупречныйМощный удар, наносящий базовый физический урон,плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физ. урона.Оглушает противника на ^96f5ff%d^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью ^96f5ff35%%^f7dfa5 не затратит ци."4070  "Темный летящий дракон"4071  "^8080ffТемный летящий дракон^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДемонМощный удар, наносящий базовый физический урон,плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физ. урона.Оглушает противника на ^96f5ff%d^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Время оглушения увеличивается на ^96f5ff1,5^d618e7 сек."4080  "Светлый удар лавины"4081  "^8080ffСветлый удар лавины^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff2,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffБезупречныйВоин обрушивает мощный, как горная лавина, удар на всех противников в радиусе ^96f5ff10^ffffff м.,нанося базовый физический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физ. урона.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 повышает шанс критического удара на ^96f5ff20%%^f7dfa5 на ^96f5ff10^f7dfa5 сек."4090  "Темный удар лавины"4091  "^8080ffТемный удар лавины^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff2,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДемонВоин обрушивает мощный, как горная лавина, удар на всех противников в радиусе ^96f5ff10^ffffff м.,нанося им базовый физический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физ. урона.^d618e7С вероятностью ^96f5ff20%%^d618e7 на ^96f5ff10^d618e7 сек. скорость обычной атаки воина возрастает на ^96f5ff25%%^d618e7."4100  "Светлая ревущая гора"4101  "^8080ffСветлая ревущая гора^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,4 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffПросвещенныйВоин собирает все силы и бьет по земле, нанося противникам в радиусе ^96f5ff10^ffffff м.базовый физический урон плюс ^96f5ff3097^ffffff ед. физического урона.Скорость противников уменьшается на ^96f5ff50%%^ffffff на ^96f5ff%d^ffffff сек.^f7dfa5Снижает защиту противников от огня на ^96f5ff30%%^f7dfa5."4110  "Темная ревущая гора"4111  "^8080ffТемная ревущая гора^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,3 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,4 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДух злаВоин собирает все силы и бьет по земле, нанося противникам в радиусе ^96f5ff10^ffffff м.базовый физический урон плюс ^96f5ff3097^ffffff ед. физического урона.Скорость противников уменьшается на ^96f5ff50%%^ffffff на ^96f5ff%d^ffffff сек.^d618e7Эффект снижения скорости противников увеличивается до ^96f5ff65%%^d618e7."4120  "Светлый гнев небес"4121  "^8080ffСветлый гнев небес^ffcb4aДальность: ^ffffff8 ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff30.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffПросвещенныйКонцентрируя свою энергию, воин призывает пламенных драконов,которые атакуют всех противников в радиусе ^96f5ff12^ffffff м.Наносит базовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия,плюс ^96f5ff5975^ffffff ед. физического урона. В течение ^96f5ff6^ffffff сек. противникиполучают на ^96f5ff%d%%^ffffff больше урона.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^f7dfa5После применения восстанавливает ^96f5ff0,75^f7dfa5 ци."4130  "Темный гнев небес"4131  "^8080ffТемный гнев небес^ffcb4aДальность: ^ffffff8 ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff30.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДух злаКонцентрируя свою энергию, воин призывает пламенных драконов,которые атакуют всех противников в радиусе ^96f5ff12^ffffff м.Наносит базовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия,плюс ^96f5ff5975^ffffff ед. физического урона. В течение ^96f5ff6^ffffff сек. противникиполучают на ^96f5ff%d%%^ffffff больше урона.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци.^d618e7Эффект увеличения урона действует ^96f5ff9^d618e7 сек."4140  "Светлый удар пустоты"4141  "^8080ffСветлый удар пустоты^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffБезупречныйЯркий свет, исходящий из клинка, поражает противника, наносябазовый физический урон, плюс ^96f5ff50%%^ffffff урона оружия,плюс ^96f5ff4863^ffffff ед. физического урона.В течение ^96f5ff8^ffffff сек. замедляет подготовку заклинаний противника на ^96f5ff50%%^ffffff. Не промахивается.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 не затратит ци.^f7dfa5Замедляет подготовку заклинаний на ^96f5ff100%%^f7dfa5."4150  "Темный удар пустоты"4151  "^8080ffТемный удар пустоты^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffДемонЯркий свет, исходящий из клинка, поражает противника, наносябазовый физический урон, плюс ^96f5ff50%%^ffffff урона оружия,плюс ^96f5ff4863^ffffff ед. физического урона.В течение ^96f5ff8^ffffff сек. замедляет подготовку заклинаний противника на ^96f5ff50%%^ffffff. Не промахивается.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Поражает противников в радиусе ^96f5ff3^d618e7 м. от цели.^d618e7Замедляет подготовку заклинаний на ^96f5ff100%%^f7dfa5."4160  "Светлый призрачный охотник"4161  "^8080ffСветлый призрачный охотник^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,9 ^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffБезупречныйЗапускает в противника призрачные мечи, нанося ему базовый физический урон,плюс ^96f5ff180%%^ffffff урона оружия, плюс ^96f5ff3777^ffffff ед. физического урона. Не промахивается.^f7dfa5Время подготовки и применения сокращается на ^96f5ff0,1^f7dfa5 сек."4170  "Темный призрачный охотник"4171  "^8080ffТемный призрачный охотник^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,9 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffДемонЗапускает в противника призрачные мечи, нанося ему базовый физический урон,плюс ^96f5ff180%%^ffffff урона оружия, плюс ^96f5ff3777^ffffff ед. физического урона. Не промахивается.^d618e7С вероятностью ^96f5ff25%%^d618e7 дополнительно приносит ^96f5ff0,2^d618e7 ци."4180  "Светлый дух меча"4181  "^8080ffСветлый дух меча^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffПросвещенныйТочный удар меча наносит противнику базовый физический урон,плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff%d^ffffff м.^f7dfa5При попадании с вероятностью ^96f5ff25%%^f7dfa5 дополнительно приносит ^96f5ff0,25^f7dfa5 ци."4190  "Темный дух меча"4191  "^8080ffТемный дух меча^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffДух злаТочный удар меча наносит противнику базовый физический урон,плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff%d^ffffff м.^d618e7С вероятностью ^96f5ff50%% ^d618e7на ^96f5ff8^d618e7 сек. снижает способность противника к уклонению^d618e7на ^96f5ff50%%^d618e7."4200  "Светлые десять тысяч лезвий"4201  "^8080ffСветлые десять тысяч лезвий^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffПросвещенныйВоин обрушивает на противников в радиусе ^96f5ff12^ffffff м. настоящий дождь из острых лезвий.Удары суммарно наносят по ^96f5ff350%%^ffffff базового физического урона. Не промахивается.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью ^96f5ff50%%^f7dfa5 затратит ^96f5ff0,5^f7dfa5 ци."4210  "Темные десять тысяч лезвий"4211  "^8080ffТемные десять тысяч лезвий^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffДух злаВоин обрушивает на противников в радиусе ^96f5ff12^ffffff м. настоящий дождь из острых лезвий.Удары суммарно наносят по ^96f5ff350%%^ffffff базового физического урона. Не промахивается.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Дополнительно наносит еще ^96f5ff20%%^d618e7 базового физического урона."4220  "Светлая аура стали"4221  "^8080ffСветлая аура стали^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйВоин издает боевой клич, подбадривающий окружающих соратников,и их физическая защита увеличивается на ^96f5ff%d%%^ffffff на ^96f5ff30^ffffff мин.^f7dfa5Прирост защиты увеличивается до ^96f5ff90%%^f7dfa5."4230  "Темная аура стали"4231  "^8080ffТемная аура стали^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонВоин издает боевой клич, подбадривающий окружающих соратников,и их физическая защита увеличивается на ^96f5ff75%%^ffffff на ^96f5ff30^ffffff мин.^d618e7На ^96f5ff15^d618e7 сек. союзники получают дополнительный прирост физической защиты на ^96f5ff75%%^d618e7."4240  "Светлый львиный рык"4241  "^8080ffСветлый львиный рык^ffcb4aДальность: ^ffffff5 ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйЯростный рык оглушает всех врагов в радиусе ^96f5ff10^ffffff мна ^96f5ff%d^ffffff сек. Чем выше уровень умения, тем больше шансы на успех.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци.^f7dfa5Затраты ци снижаются на ^96f5ff0,15^f7dfa5."4250  "Темный львиный рык"4251  "^8080ffТемный львиный рык^ffcb4aДальность: ^ffffff5 ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонЯростный рык оглушает всех врагов в радиусе ^96f5ff10^ffffff мна ^96f5ff%d^ffffff сек. Чем выше уровень умения, тем больше шансы на успех.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци.^d618e7Перезарядка занимает на ^96f5ff1^d618e7 сек. меньше. Умение срабатывает всегда."4260  "Светлая сутра о внутреннем"4261  "^8080ffСветлая сутра о внутреннем^ffcb4aМаг. энергия: ^96f5ff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНа ^96f5ff30^ffffff сек. повышает магическую защиту на ^96f5ff150%%^ffffff,но снижает физическую защиту на ^96f5ff120%%^ffffff.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно.^f7dfa5Бонус к магической защите увеличивается до ^96f5ff180%%^f7dfa5."4270  "Темная сутра о внутреннем"4271  "^8080ffТемная сутра о внутреннем^ffcb4aМаг. энергия: ^96f5ff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНа ^96f5ff30^ffffff сек. повышает магическую защиту на ^96f5ff150%%^ffffff,но снижает физическую защиту на ^96f5ff120%%^ffffff.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно.^d618e7Снижает физическую защиту лишь на ^96f5ff90%%^d618e7."*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL27 
#define __CPPGEN_GNET_SKILL27 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill27:public Skill 
    { 
    public: 
        enum { SKILL_ID = 27 }; 
        Skill27 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill27Stub:public SkillStub 
    { 
    public: 
#ifdef _SKILL_SERVER 
        class State1:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 2350;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetPray (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State2:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 1000;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->SetWaterdamage (skill->GetMagicattack ());
                skill->GetPlayer ()->SetPerform (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State3:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 0;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
    Skill27Stub ():SkillStub (27) 
    { 
        cls                 = 127; 
#ifdef _SKILL_CLIENT 
        name                = L"��׶��"; 
        nativename          = "��׶��"; 
        icon                = ""; 
#endif 
        max_level           = 10; 
        type                = 1; 
        allow_ride          = 0; 
        attr                = 4; 
        rank                = 0; 
        eventflag           = 0; 
        is_senior           = 0; 
        is_inherent         = 0; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 0; 
        allow_forms         = 0; 
        apcost              = 0; 
        apgain              = 0; 
        doenchant           = 1; 
        dobless             = 0; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 0; 
        time_type           = 0; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 0; 
        combosk_interval    = 0; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = "�����׶��.sgc"; 
        aerial_effect       = ""; 
#endif 
        range.type          = 0; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 0; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(0, 1)); 
#ifdef _SKILL_SERVER 
        statestub.push_back (new State1 ()); 
        statestub.push_back (new State2 ()); 
        statestub.push_back (new State3 ()); 
#endif 
    } 
        int GetExecutetime (Skill * skill) const
        {
            return 1000;
        }
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
        float GetRadius (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAttackdistance (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAngle (Skill * skill) const
        {
            return (float) (1 - 0.0111111 * (0));
        }
        float GetPraydistance (Skill * skill) const
        {
            return (float) (15);
        }
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
        int GetIntroduction (Skill * skill, wchar_t * buffer, int length, wchar_t * format) const
        {
            return _snwprintf (buffer, length, format);
        }
#endif 
#ifdef _SKILL_SERVER 
        int GetEnmity (Skill * skill) const
        {
            return 10;
        }
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool StateAttack (Skill * skill) const
        {
            skill->GetVictim ()->SetProbability (1.0 * 100);
            skill->GetVictim ()->SetTime (4000);
            skill->GetVictim ()->SetRatio (0.6);
            skill->GetVictim ()->SetSlow (1);
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
    bool BlessMe (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        float GetEffectdistance (Skill * skill) const
        {
            return (float) (25);
        }
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    int GetAttackspeed (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool TakeEffect (Skill * skill) const
        {;
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetHitrate (Skill * skill) const
        {
            return (float) (1.0);
        }
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
