//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
9000  "Алмазная аура"9001  "^8080ffАлмазная аура^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aмин.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБессмертный, Сын адаАлмазная аура защищает воина и всех членов его группы.Физическая защита от снаряжения повышается на ^96f5ff1000%%^ffffff на ^96f5ff10^ffffff сек.Воин восстанавливает ^96f5ff20%%^ffffff от максимального уровня здоровья за ^96f5ff15^ffffff сек."9230  "Вспышка"9231  "^8080ffВспышка^ffcb4aДальность: ^96f5ff5 ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff2^ffcb4a мин.^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffБессмертный, Сын адаНаносит ^96f5ff150%%^ffffff базового физ. урона плюс ^96f5ff300%%^ffffff урона оружия.Если запас жизненных сил атакующего ниже,чем у цели, то противник получает ^96f5ff200%%^ffffff дополнительного урона.Этот навык не может наносить критический удар, но с вероятностью,равной двукратному шансу критического удара, наносит полуторакратный урон.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."9240  "Алмазная аура"9241  "^8080ffАлмазная аура^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aмин.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБессмертный, Сын адаАлмазная аура защищает воина и всех членов его группы.Физическая защита от снаряжения повышается на ^96f5ff1000%%^ffffff на ^96f5ff10^ffffff сек.Воин восстанавливает ^96f5ff20%%^ffffff от максимального уровня здоровья за ^96f5ff15^ffffff сек."11950  "Ослепление"11951  "^ffffffОслепление Уровень %d^ffcb4aДальность: ^ffffffближний бой:^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff8,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffклинок^ffcb4aСтатус: ^ffffffОпытныйУвеличение физ. силы удара.Противник получает ^96f5ff%.1f^ffffff ед. урона.Ликвидация маневра врага."18150  "Таран"18151  "^ffff00Таран^ffcb4aДальность: ^96f5ff15^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff141^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff90.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмечи, древковое оружие, топоры и молоты, без оружия^ffcb4aСтатус: ^ffffffБлагочестивыйВоин мгновенно оказывается рядом с противником и мощным ударомобездвиживает его на ^96f5ff3^ffffff сек.Наносит базовый физический урон плюс ^96f5ff120%%^ffffff урона оружия.Если уровень ЖС противника был ниже ^96f5ff50%%^ffffff, наносится ^96f5ffдвойной^ffffff урон.Этот навык не может наносить критический удар, но с вероятностью, в 2 раза превышающейшанс критического удара, наносит урон в 1,5 раза больше обычного.'Хозяин пурпурной страны смеется, все знают - идет настоящий герой'.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."18160  "Пустота - Кара богов"18161  "^80ff00Пустота - Кара богов^ffcb4aМаг. энергия: ^96f5ff495^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.Применение: ^ffffff1,7^ffcb4a сек.Перезарядка: ^ffffff180.0^ffcb4a сек.Ограничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйСоздает вокруг воина вихрь, поражающий всех противников в радиусе 10 м.Каждые 3 сек. в течение 12 сек. им наносится базовый физический урон плюс 450%% урона оружия,а их скорость передвижения уменьшается на 50%% на 3 сек. Пока воин в вихре, он не подвержен эффектам контроля, кроме паралича,и получает на 50%% меньше урона, но не может атаковать, использовать навыки или умения джинна.В зависимости от силы духа воина наносит еще 12000 - 20000 ед. урона. Умение не может нанести крит.удар,но с вероятностью в 2 раза выше шанса критического удара наносит 1,5-кратный урон.За ^96f5ff12^ffffff сек. действия восст. ^96f5ff2^ffffff ци.^a6caf0Дополнительная стоимость: ^ffffff3^a6caf0 ци."18170  "Ударная волна"18171  "^ffff00Ударная волна^ffcb4aДальность: ^ffffffближний бой^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,9^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff120,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйМожно использовать при уровне здоровья не выше ^96f5ff75%%^ffffff.Поражает всех противников перед воином на линии длиной ^96f5ff12^ffffff м.Наносит им базовый физический урон плюс ^96f5ff200%%^ffffff урона оружия и еще ^96f5ff7200^ffffff ед. физического урона.Оглушает противников на ^96f5ff3^ffffff сек. Удар всегда попадает в цель."18180  "Разгром"18181  "^ffff00Разгром^ffcb4aДальность: ^96f5ff25^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff353^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,9^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff60^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйВоин бросает свое оружие в противников, оказываясь безоружным на ^96f5ff3^ffffff сек.,но также обезоруживает всех противников в радиусе ^96f5ff8^ffffff м. на ^96f5ff6^ffffff сек.Всем им наносится базовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия,плюс ^96f5ff3500^ffffff ед. физического урона. Удар всегда попадает в цель.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци."18190  "Драконий аркан"18191  "^ffff00Драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff2.0^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff120.0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aСтатус: ^ffffffБлагочестивыйПритягивает противника к воину.Результат зависит от уровня и силы духа персонажей:при равном уровне шанс на успех варьируется от ^96f5ff40%%^ffffff до ^96f5ff100%%^ffffff.При равной силе духа он составляет ^96f5ff70%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."18680  "8706856"18681  "Эффект 'Пустота - Кара богов'."18710  "Кара богов"18711  "^ffff00Кара богов^ffcb4aМаг. энергия: ^96f5ff392^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,7 ^ffcb4aсек.Перезарядка: ^ffffff300.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйСоздает вокруг воина сильный вихрь, поражающий всех противников в радиусе ^96f5ff10^ffffff м.Каждые ^96f5ff3^ffffff сек. в течение ^96f5ff12^ffffff сек. им наносится базовый физический урон, плюс ^96f5ff200%%^ffffff урона оружия,плюс определенный физический урон.Пока воин в вихре, он не подвержен никаким эффектам контроля, кроме паралича, и получает на ^96f5ff50%%^ffffff меньше урона,но не может атаковать, использовать навыки или умения джинна.Дополнительный урон: ^96f5ff2500^ffffff - ^96f5ff6500^ffffff ед., зависит от силы духа персонажа.После применения за ^96f5ff12^ffffff сек. приносит ^96f5ff2^ffffff ци.^a6caf0Дополнительная стоимость: ^ffffff2,99^a6caf0 ци."18720  "8706857"18721  "Эффект 'Кары богов'."22060  "Божественный взрыв гнева"22061  "^ffff00Божественный взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. и вызывает кровотечение,которое через ^96f5ff3^ffffff сек. наносит ему ^96f5ff300%%^ffffff урона оружияплюс ^96f5ff%d^ffffff ед. физического урона.^f7dfa5Дополнительно приносит ^96f5ff0,05^f7dfa5 ци."22070  "Демонический взрыв гнева"22071  "^ffff00Демонический взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. и вызывает кровотечение,которое через ^96f5ff3^ffffff сек. наносит ему ^96f5ff300%%^ffffff урона оружияплюс ^96f5ff%d^ffffff ед. физического урона.^d618e7Урон, наносимый кровотечением, увеличивается на ^96f5ff100%%^d618e7 атаки оружием."22080  "Божественное сокрушение"22081  "^ffff00Божественное сокрушение^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСокрушительный круговой удар наносит противникам в радиусе ^96f5ff10^ffffff м.базовый физический урон плюс ^96f5ff5416^ffffff ед. физического урона.^f7dfa5Дополнительный урон увеличивается на ^96f5ff1825^f7dfa5 ед."22090  "Демоническое сокрушение"22091  "^ffff00Демоническое сокрушение^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонСокрушительный круговой удар наносит противникам в радиусе ^96f5ff10^ffffff м.базовый физический урон, плюс ^96f5ff5416^ffffff физического урона.^d618e7Зона поражения увеличивается до ^96f5ff12^d618e7 м."22100  "Божественная неукротимая буря"22101  "^ffff00Божественная неукротимая буря^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНаносит противнику базовый физический урон, плюс ^96f5ff140%%^ffffff урона оружия, плюс^96f5ff4664^ffffff ед. физического урона и вынуждает противника атаковать воина.С вероятностью ^96f5ff55%%^ffffff оглушает противника на ^96f5ff3^ffffff сек.^f7dfa5Дополнительный урон от оружия увеличивается до ^96f5ff180%%^f7dfa5."22110  "Демоническая неукротимая буря"22111  "^ffff00Демоническая неукротимая буря^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНаносит противнику базовый физический урон, плюс ^96f5ff140%%^ffffff урона оружия, плюс^96f5ff4664^ffffff ед. физического урона и вынуждает противника атаковать воина.С вероятностью ^96f5ff55%%^ffffff оглушает противника на ^96f5ff3^ffffff сек. ^d618e7Время перезарядки сокращается на ^96f5ff1^d618e7 сек."23520  "Божественная самозарядная пушка"23521  "^ffff00Божественная самозарядная пушка^ffcb4aДальность: ^96f5ff20^ffffff ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffБезупречныйВнезапный удар по стоящему в отдалении противнику.Наносит базовый физический урон, плюс ^96f5ff150%%^ffffff урона оружия, плюс ^96f5ff6918^ffffff ед. физического урона.Обездвиживает цель на ^96f5ff3^ffffff сек., если она находится на расстоянии более ^96f5ff10^ffffff м.Если цель находится в пределах ^96f5ff10^ffffff м, дополнительно наносит базовый физический урон. ^f7dfa5Урон от оружия увеличивается на ^96f5ff60%%^f7dfa5, дополнительный урон - на ^96f5ff1200^f7dfa5 ед."23670  "Демоническая самозарядная пушка"23671  "^ffff00Демоническая самозарядная пушка^ffcb4aДальность: ^96f5ff20^ffffff ^ffcb4aм.^ffcb4a^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffДемонВнезапный удар по стоящему в отдалении противнику.Наносит базовый физический урон, плюс ^96f5ff150%%^ffffff урона оружия, плюс ^96f5ff6918^ffffff ед. физического урона.Обездвиживает цель на ^96f5ff3^ffffff сек., если она находится на расстоянии более ^96f5ff10^ffffff м.Если цель находится в пределах ^96f5ff10^ffffff м, дополнительно наносит базовый физический урон.Не наносит критического урона.^d618e7Получение ци увеличивается до ^96f5ff0,2^d618e7 ци. Не промахивается."23680  "Божественный призрачный охотник"23681  "^ffff00Божественный призрачный охотник^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffБезупречныйЗапускает в противника призрачные мечи, нанося ему базовый физический урон,плюс ^96f5ff300%%^ffffff урона оружия, плюс ^96f5ff7712^ffffff ед. физического урона. Не промахивается.^f7dfa5Время подготовки сокращается на ^96f5ff0,2^f7dfa5 сек."23690  "Демонический призрачный охотник"23691  "^ffff00Демонический призрачный охотник^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffДемонЗапускает в противника призрачные мечи, нанося ему базовый физический урон,плюс ^96f5ff300%%^ffffff урона оружия, плюс ^96f5ff7712^ffffff ед. физического урона. Не промахивается.^d618e7Получение ци увеличивается до ^96f5ff0,6^d618e7."23700  "Божественный крушитель небес"23701  "^ffff00Божественный крушитель небес^ffcb4aДальность: ^96f5ff8^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,3^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,3^ffcb4aОграничение по оружию: ^ffffffдревковое оружие, мечи^ffcb4aСтатус: ^ffffffПросвещенныйНевероятный удар, которым воин поражает врагов на расстоянии до ^96f5ff25^ffffff м.Наносит базовый физический урон плюс ^96f5ff5115^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff18^ffffff м. Не промахивается.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: дальность снижается до дистанции ближнего боя, дополнительно наносит ^96f5ff300%%^ffffff урона оружия.^f7dfa5При попадании прерывает умения противника."23710  "Демонический крушитель небес"23711  "^ffff00Демонический крушитель небес^ffcb4aДальность: ^96f5ff8^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,3^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,3^ffcb4aОграничение по оружию: ^ffffffдревковое оружие, мечи^ffcb4aСтатус: ^ffffffДух злаНевероятный удар, которым воин поражает врагов на расстоянии до ^96f5ff25^ffffff м.Наносит базовый физический урон плюс ^96f5ff5115^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff18^ffffff м. Не промахивается.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: дальность снижается до дистанции ближнего боя, дополнительно наносит ^96f5ff300%%^ffffff урона оружия.^d618e7На ^96f5ff8^d618e7 сек. снижает способность противников к уклонению на ^96f5ff50%%^d618e7."23720  "Божественный удар лавины"23721  "^ffff00Божественный удар лавины^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffПросвещенныйВоин обрушивает мощный, как горная лавина, удар на всех противников в радиусе ^96f5ff10^ffffff м,нанося базовый физический урон, плюс ^96f5ff165%%^ffffff урона оружия, плюс ^96f5ff7703^ffffff ед. физического урона.Скорость противников уменьшается на ^96f5ff50%%^ffffff на ^96f5ff%d^ffffff сек.С вероятностью до ^96f5ff50%%^ffffff наносит дополнительный физический урон.Эта вероятность зависит от силы духа воина.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 повышает шанс критического удара на ^96f5ff20%%^f7dfa5 на ^96f5ff10^f7dfa5 сек."23730  "Демонический удар лавины"23731  "^ffff00Демонический удар лавины^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДух злаВоин обрушивает мощный, как горная лавина, удар на всех противников в радиусе ^96f5ff10^ffffff м,нанося базовый физический урон, плюс ^96f5ff165%%^ffffff урона оружия, плюс ^96f5ff7703^ffffff ед. физического урона.Скорость противников уменьшается на ^96f5ff50%%^ffffff на ^96f5ff%d^ffffff сек.С вероятностью до ^96f5ff50%%^ffffff наносит дополнительный физический урон.Эта вероятность зависит от силы духа воина.^d618e7Эффект снижения скорости противников увеличивается до ^96f5ff65%%^d618e7."23740  "Божественный гнев дракона"23741  "^ffff00Божественный гнев дракона^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек. ^ffcb4aПерезарядка: ^ffffff15,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, древковое оружие, мечи^ffcb4aСтатус: ^ffffffБезупречныйЧудовищный удар, наносящий базовый физический урон, плюс ^96f5ff105%%^ffffff урона оружия,плюс ^96f5ff5834^ffffff ед. физического урона. Парализует противника на ^96f5ff4^ffffff сек. Не промахивается.Эффекты зависят от применяемого оружия.Топоры и молоты: время паралича увеличивается до ^96f5ff6^ffffff сек.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: не парализует цель. Время подготовки сокращается до ^96f5ff0,2^ffffff сек., время применения - до ^96f5ff1,4^ffffff сек.Добавляется ^96f5ff300%%^ffffff урона оружия.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью 35%% восстанавливает ^96f5ff1^f7dfa5 ци."23750  "Демонический гнев дракона"23751  "^ffff00Демонический гнев дракона^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, древковое оружие, мечи^ffcb4aСтатус: ^ffffffДемонЧудовищный удар, наносящий базовый физический урон, плюс ^96f5ff105%%^ffffff урона оружия,плюс ^96f5ff5834^ffffff ед. физического урона. Парализует противника на ^96f5ff4^ffffff сек. Не промахивается.Эффекты зависят от применяемого оружия.Топоры и молоты: время паралича увеличивается до ^96f5ff7^ffffff сек.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: не парализует цель. Время подготовки сокращается до ^96f5ff0,2^ffffff сек., время применения - до ^96f5ff1,4^ffffff сек.Добавляется ^96f5ff300%%^ffffff урона оружия.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Время паралича увеличено на ^96f5ff1,5^d618e7 сек."31930  "Таинственный драконий аркан"31931  "^ffff00Таинственный драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff120^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aСтатус: ^ffffffБлагочестивыйПритягивает к воину врагов в радиусе ^96f5ff8^ffffff м. от цели.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."31940  "Божественный львиный рык"31941  "^ffff00Божественный львиный рык^ffcb4aДальность: ^ffffff5 м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйЯростный рык оглушает всех врагов в радиусе ^96f5ff10^ffffff м на ^96f5ff6^ffffff сек.^96f5ffЧем выше уровень умения, тем больше шансы на успех.^ffffffВсе враги в радиусе ^96f5ff10^ffffff м будут обезоружены на ^96f5ff6^ffffff сек.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Умение поражает цель, оглушая и обезоруживая ее на ^96f5ff5^ffffff сек.Мечи: не оглушает и не обезоруживает цели. Время подготовки сокращается до ^96f5ff0,1^ffffff сек., время применения - до ^96f5ff1,0^ffffff сек.Наносит противникам в радиусе ^96f5ff10^ffffff м ^96f5ff200%%^ffffff урона оружия. Не может нанести критический урон, но с вероятностью, в 2 разапревышающей шанс критического удара, наносит ^96f5ffполуторакратный^ffffff урон.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци.^f7dfa5Затраты ци снижаются на ^96f5ff0,15^f7dfa5."31950  "Демонический львиный рык"31951  "^ffff00Демонический львиный рык^ffcb4aДальность: ^ffffff5 м^ffcb4aМаг. энергия: ^96f5ff%d^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.Применение: ^ffffff1,2 ^ffcb4aсек.Перезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.Ограничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонЯростный рык оглушает всех врагов в радиусе ^96f5ff10^ffffff м на ^96f5ff6^ffffff сек.^96f5ffЧем выше уровень умения, тем больше шансы на успех.^ffffffВсе враги в радиусе ^96f5ff10^ffffff м будут обезоружены на ^96f5ff6^ffffff сек.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Умение поражает цель, оглушая и обезоруживая ее на ^96f5ff5^ffffff сек.Мечи: не оглушает и не обезоруживает цели. Время подготовки сокращается до ^96f5ff0,1^ffffff сек., время применения - до ^96f5ff1,0^ffffff сек.Наносит противникам в радиусе ^96f5ff10^ffffff м ^96f5ff200%%^ffffff урона оружия. Не может нанести критический урон, но с вероятностью, в 2 разапревышающей шанс критического удара, наносит ^96f5ffполуторакратный^ffffff урон.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци.^d618e7Перезарядка сокращена на 1 сек. Умение срабатывает всегда."31960  "Божественный стремительный дракон"31961  "^ffff00Божественный стремительный дракон^ffcb4aДальность: ^96f5ff%d^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСоздает стремительное лезвие из света,которое наносит базовый физ. урон плюс ^96f5ff6747^ffffff ед. физ. урона.С вероятностью ^96f5ff66%%^ffffff обездвиживает цель на ^96f5ff3^ffffff сек.Дальность атаки умения увеличена в ^96f5ff2^ffffff раза.^f7dfa5Время перезарядки сокращается на ^96f5ff1^f7dfa5 сек."31970  "Демонический стремительный дракон"31971  "^ffff00Демонический стремительный дракон^ffcb4aДальность: ^96f5ff%d^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонСоздает стремительное лезвие из света,которое наносит базовый физ. урон плюс ^96f5ff6747^ffffff ед. физ. урона.С вероятностью ^96f5ff66%%^ffffff обездвиживает цель на ^96f5ff3^ffffff сек.Дальность атаки умения увеличена в ^96f5ff2^ffffff раза.^d618e7Дальность атаки увеличивается на ^96f5ff2^d618e7 м."31980  "Дух воина"31981  "^ff0000Дух воина Ур. %d|if&dynskilllv()>0&^ffcb4a +%d&|^ffcb4aМаг. энергия: ^96f5ff225^ffffff^ffcb4aПодготовка: ^ffffff0,1 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,9 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff300 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aРасходуемые предметы: ^96f5ffЖивая душа^ffffff^ffcb4aСтатус: ^ffffffБлагочестивыйПризывает Дух воина на ^96f5ff|if&(skilllv()+dynskilllv())<2&10&20|^ffffff сек. Во время действия этого умения каждое атакующее умениебудет увеличивать урон от следующего умения на ^96f5ff20%%^ffffff. Эффект может суммироваться до ^96f5ff100%%^ffffff.|if&(skilllv()+dynskilllv())>2&^ffffffУр. 3: Каждое атакующее умение увеличивает урон от следующего умения на ^96f5ff50%%^ffffff, эффект суммируется до ^96f5ff100%%^ffffff.После применения восстанавливается весь запас ци.Во время действия умения каждую секунду также восстанавливается ^96f5ff1^ffffff ци.&^808080Ур. 3: Каждое атакующее умение увеличивает урон от следующего умения на 50%%, эффект суммируется до 100%%.После применения восстанавливается весь запас ци.Во время действия умения каждую секунду также восстанавливается 1 ци.|"38950  "Великий взрыв гнева"38951  "^ff5c00Великий взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. физ. урона.Эффекты зависят от применяемого оружия.Топоры и молоты: вызывает кровотечение, которое через ^96f5ff3^ffffff сек. наносит цели ^96f5ff350%%^ffffff урона оружия плюс ^96f5ff%d^ffffff ед. физ. урона.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: добавляется ^96f5ff200%%^ffffff урона оружия плюс ^96f5ff1839^ffffff ед. физ. урона.Другое оружие: эффект аналогичен эффекту для топоров и молотов."38960  "Великий взрыв гнева"38961  "^ff5c00Великий взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. физ. урона.Эффекты зависят от применяемого оружия.Топоры и молоты: вызывает кровотечение, которое через ^96f5ff3^ffffff сек. наносит цели ^96f5ff350%%^ffffff урона оружия плюс ^96f5ff%d^ffffff ед. физ. урона.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: добавляется ^96f5ff200%%^ffffff урона оружия плюс ^96f5ff1839^ffffff ед. физ. урона.Другое оружие: эффект аналогичен эффекту для топоров и молотов.^ffcb4aЭффект золотой руны:@1^ffcb4a1-4 ур.: добавляется ^96f5ff20%%^ffcb4a урона оружия^ffcb4a5-7 ур.: добавляется ^96f5ff30%%^ffcb4a урона оружия^ffcb4a8-9 ур.: добавляется ^96f5ff40%%^ffcb4a урона оружия^ffcb4a 10 ур.: добавляется ^96f5ff50%%^ffcb4a урона оружия@1@2^ffcb4aДобавляется ^96f5ff%d%%^ffcb4a урона оружия.@2"38970  "Великий взрыв гнева"38971  "^ff5c00Великий взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. физ. урона.Эффекты зависят от применяемого оружия.Топоры и молоты: вызывает кровотечение, которое через ^96f5ff3^ffffff сек. наносит цели ^96f5ff350%%^ffffff урона оружия плюс ^96f5ff%d^ffffff ед. физ. урона.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: добавляется ^96f5ff200%%^ffffff урона оружия плюс ^96f5ff1839^ffffff ед. физ. урона.Другое оружие: эффект аналогичен эффекту для топоров и молотов.^00ff00Эффект изумрудной руны:@1^00ff001-4 ур.: добавляется ^96f5ff60%%^00ff00 урона оружия от кровотечения^00ff005-7 ур.: добавляется ^96f5ff90%%^00ff00 урона оружия от кровотечения^00ff008-9 ур.: добавляется ^96f5ff120%%^00ff00 урона оружия от кровотечения^00ff00 10 ур.: добавляется ^96f5ff150%%^00ff00 урона оружия от кровотечения@1@2^00ff00Добавляется ^96f5ff%d%%^00ff00 урона оружия от кровотечения.@2"38980  "Великий взрыв гнева"38981  "^ff5c00Великий взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. физ. урона.Эффекты зависят от применяемого оружия.Топоры и молоты: вызывает кровотечение, которое через ^96f5ff3^ffffff сек. наносит цели ^96f5ff350%%^ffffff урона оружия плюс ^96f5ff%d^ffffff ед. физ. урона.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: добавляется ^96f5ff200%%^ffffff урона оружия плюс ^96f5ff1839^ffffff ед. физ. урона.Другое оружие: эффект аналогичен эффекту для топоров и молотов.^00ffffЭффект сапфировой руны:@1^00ffff1-4 ур.: получение ци увеличивается до ^ffffff0,25^00ffff5-7 ур.: получение ци увеличивается до ^ffffff0,3^00ffff8-9 ур.: получение ци увеличивается до ^ffffff0,35^00ffff 10 ур.: получение ци увеличивается до ^ffffff0,4@1@2^00ffffПолучение ци увеличивается до ^ffffff0,%d.@2"38990  "Великий взрыв гнева"38991  "^ff5c00Великий взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. физ. урона.Эффекты зависят от применяемого оружия.Топоры и молоты: вызывает кровотечение, которое через ^96f5ff3^ffffff сек. наносит цели ^96f5ff350%%^ffffff урона оружия плюс ^96f5ff%d^ffffff ед. физ. урона.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: добавляется ^96f5ff200%%^ffffff урона оружия плюс ^96f5ff1839^ffffff ед. физ. урона.Другое оружие: эффект аналогичен эффекту для топоров и молотов.^ff0000Эффект рубиновой руны:@1^ff0000Расходуется ^96f5ff50%%^ff0000 от текущей ци, за каждые 0,01 ци меткость повышается на ^96f5ff10%%^ff0000.^ff00001-4 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff125%%^ff0000 урона^ff00005-7 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff150%%^ff0000 урона^ff00008-9 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff175%%^ff0000 урона^ff0000 10 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff200%%^ff0000 урона@1@2^ff0000Расходуется ^96f5ff50%%^ff0000 от текущей ци, за каждую 0,01 ци меткость повышается на ^96f5ff10%%^ff0000.При каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff%d%%^ff0000 урона.@2"39000  "Великий взрыв гнева"39001  "^ff5c00Великий взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. физ. урона.Эффекты зависят от применяемого оружия.Топоры и молоты: вызывает кровотечение, которое через ^96f5ff3^ffffff сек. наносит цели ^96f5ff350%%^ffffff урона оружия плюс ^96f5ff%d^ffffff ед. физ. урона.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: добавляется ^96f5ff200%%^ffffff урона оружия плюс ^96f5ff1839^ffffff ед. физ. урона.Другое оружие: эффект аналогичен эффекту для топоров и молотов.^ffeaabЭффект серебряной руны:@1^ffeaab1-4 ур.: мечи позволяют нанести еще ^96f5ff40%%^ffeaab урона оружия^ffeaab5-7 ур.: мечи позволяют нанести еще ^96f5ff60%%^ffeaab урона оружия^ffeaab8-9 ур.: мечи позволяют нанести еще ^96f5ff80%%^ffeaab урона оружия^ffeaab 10 ур.: мечи позволяют нанести еще ^96f5ff100%%^ffeaab урона оружия@1@2^ffeaabМечи позволяют нанести еще ^96f5ff%d%%^ffeaab урона оружия.@2"*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL900 
#define __CPPGEN_GNET_SKILL900 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill900:public Skill 
    { 
    public: 
        enum { SKILL_ID = 900 }; 
        Skill900 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill900Stub:public SkillStub 
    { 
    public: 
#ifdef _SKILL_SERVER 
        class State1:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 600;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetDecmp (100);
                skill->GetPlayer ()->SetPray (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 1;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State2:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 1800;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetDecmp (300);
                skill->GetPlayer ()->SetPerform (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State3:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 0;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
    Skill900Stub ():SkillStub (900) 
    { 
        cls                 = 0; 
#ifdef _SKILL_CLIENT 
        name                = L"�����"; 
        nativename          = "�����"; 
        icon                = "�����.dds"; 
#endif 
        max_level           = 1; 
        type                = 2; 
        allow_ride          = 0; 
        attr                = 1; 
        rank                = 22; 
        eventflag           = 0; 
        is_senior           = 0; 
        is_inherent         = 0; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 2155; 
        allow_forms         = 1; 
        apcost              = 0; 
        apgain              = 0; 
        doenchant           = 1; 
        dobless             = 1; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 0; 
        time_type           = 0; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 0; 
        combosk_interval    = 0; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = "��Ⱥ���ﾭ����.sgc"; 
        aerial_effect       = ""; 
#endif 
        range.type          = 2; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 0; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(0, 1)); 
        restrict_weapons.push_back (0); 
        restrict_weapons.push_back (1); 
        restrict_weapons.push_back (182); 
        restrict_weapons.push_back (5); 
        restrict_weapons.push_back (292); 
        restrict_weapons.push_back (9); 
#ifdef _SKILL_SERVER 
        statestub.push_back (new State1 ()); 
        statestub.push_back (new State2 ()); 
        statestub.push_back (new State3 ()); 
#endif 
    } 
        int GetExecutetime (Skill * skill) const
        {
            return 1800;
        }
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 600000,600000,600000,600000,600000,600000,600000,600000,600000,600000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 4000000,4000000,4000000,4000000,4000000,4000000,4000000,4000000,4000000,4000000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 100,100,100,100,100,100,100,100,100,100 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 10000000,10000000,10000000,10000000,10000000,10000000,10000000,10000000,10000000,10000000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
        float GetRadius (Skill * skill) const
        {
            return (float) (16);
        }
        float GetAttackdistance (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAngle (Skill * skill) const
        {
            return (float) (1 - 0.0111111 * (0));
        }
        float GetPraydistance (Skill * skill) const
        {
            return (float) (0);
        }
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 400,400,400,400,400,400,400,400,400,400 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
        int GetIntroduction (Skill * skill, wchar_t * buffer, int length, wchar_t * format) const
        {
            return _snwprintf (buffer, length, format, 400);

        }
#endif 
#ifdef _SKILL_SERVER 
        int GetEnmity (Skill * skill) const
        {
            return 0;
        }
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool StateAttack (Skill * skill) const
        {
            skill->GetVictim ()->SetProbability (1.0 * 100);
            skill->GetVictim ()->SetTime (10000);
            skill->GetVictim ()->SetRatio (10);
            skill->GetVictim ()->SetIncdefence (1);
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        bool BlessMe (Skill * skill) const
        {
            skill->GetVictim ()->SetProbability (1.0 * 100);
            skill->GetVictim ()->SetTime (15000);
            skill->GetVictim ()->SetValue (skill->GetPlayer ()->GetMaxhp () / 20);
            skill->GetVictim ()->SetHpgen (1);
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetEffectdistance (Skill * skill) const
        {
            return (float) (5);
        }
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        int GetAttackspeed (Skill * skill) const
        {
            return 9;
        }
#endif 
#ifdef _SKILL_SERVER 
        bool TakeEffect (Skill * skill) const
        {;
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetHitrate (Skill * skill) const
        {
            return (float) (1.0);
        }
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
