//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
800  "Техника боя с кастетом"801  "^ffffffТехника боя с кастетом Уровень %d^ffcb4aПассивный навык^ffcb4aСтатус: ^ffffffРассудительный^ffffffУрон, наносимый кастетами, увеличивается на ^96f5ff%d%%^ffffff."1760  "Вздымающаяся волна"1761  "^ffffffВздымающаяся волна^ffcb4aМаг. энергия: ^96f5ff100^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffЗлойСкорость воина увеличивается на ^96f5ff100%%^ffffff, уклонение повышается на ^96f5ff100%%^ffffff,он становится невосприимчив к эффектам, ограничивающим передвижение, за исключением паралича.Эффект длится ^96f5ff15^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."1770  "Сутра о внутреннем"1771  "^ffffffСутра о внутреннем Уровень %d^ffcb4aМаг. энергия: ^96f5ff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffЛюбопытныйВоин собирает все силы, и его магическая защита увеличивается на ^96f5ff%d%%^ffffff,однако физическая защита падает на ^96f5ff%d%%^ffffff. Эффект сохраняется ^96f5ff30^ffffff сек.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно."1780  "Сутра о внешнем"1781  "^ffffffСутра о внешнем Уровень %d^ffcb4aМаг. энергия: ^96f5ff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffОпытныйВоин собирает все силы, и его физическая защита увеличивается на ^96f5ff%d%%^ffffff,однако магическая защита падает на ^96f5ff%d%%^ffffff. Эффект длится ^96f5ff30^ffffff сек.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно."1790  "Воин Будды"1791  "^ffffffВоин Будды Уровень %d^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff30 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffРассудительныйВосстанавливает ^96f5ff20%%^ffffff максимального запаса здоровья.Дополнительно восстанавливает ^96f5ff%d^ffffff ед. здоровья в течение ^96f5ff15^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."1870  "2233"1871  "Тестовые навыки"2260  "Вспышка ци"2261  "^ffffffВспышка ци^ffcb4aСтатус: ^ffffffРассудительныйСжигая ци, персонаж повышает силу своей физической атаки на 150%% урона оружия на 10 сек.Кроме того, в течение 1 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff1^a6caf0 ци."2270  "Высшая вспышка ци"2271  "^ffffffВысшая вспышка ци^ffcb4aСтатус: ^ffffffЗлойСжигая ци, персонаж получает 10%% от максимального запаса ЖСи повышает силу своей физической атаки на 300%% урона оружия на 12 сек.Кроме того, в течение 2 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff2^a6caf0 ци."3620  "Вспышка бессмертного"3621  "^ffffffВспышка бессмертного^ffcb4aСтатус: ^ffffffБезупречныйСжигая ци, персонаж получает 20%% от максимального запаса ЖС,и повышает силу своей физической атаки на 500%% урона оружия,а также снижает получаемый урон на 25%% на 15 сек.Кроме того, в течение 3 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff3^a6caf0 ци."3630  "Вспышка демона"3631  "^ffffffВспышка демона^ffcb4aСтатус: ^ffffffДемонСжигая ци, персонаж получает 20%% от максимального запаса ЖС,и повышает силу своей физической атаки на 500%% урона оружия,а скорость атаки на 25%% на 15 сек.Кроме того, в течение 3 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff3^a6caf0 ци."3740  "Светлый удар тигра"3741  "^8080ffСветлый удар тигра^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйЭнергичный удар, наносящий противнику базовый физический уронплюс ^96f5ff%d^ffffff ед. дополнительного урона.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 приносит ^96f5ff0,2^f7dfa5 ци."3750  "Темный удар тигра"3751  "^8080ffТемный удар тигра^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонЭнергичный удар, наносящий противнику базовый физический уронплюс ^96f5ff%d^ffffff ед. дополнительного урона.^d618e7Время подготовки и применения сокращается на ^96f5ff0,1^d618e7 сек."3760  "Светлый глубокий порез"3761  "^8080ffСветлый глубокий порез^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйТочный удар, оставляющий глубокую открытую рану.Наносит противнику базовый физический урон и вызывает кровотечение,которое в течение ^96f5ff9^ffffff сек. наносит еще ^96f5ff%d^ffffff ед. физического урона.^f7dfa5Урон от кровотечения увеличивается на ^96f5ff30%%^f7dfa5."3770  "Темный глубокий порез"3771  "^8080ffТемный глубокий порез^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонТочный удар, оставляющий глубокую открытую рану.Наносит противнику базовый физический урон и вызывает кровотечение,которое в течение ^96f5ff9^ffffff сек. наносит еще ^96f5ff%d^ffffff ед. физического урона.^d618e7Время кровотечения сокращается на ^96f5ff3^d618e7 сек."3780  "Светлое вздымающееся море"3781  "^8080ffСветлое вздымающееся море^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйМощная атака, увеличивающая уровень агрессии.Наносит базовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^f7dfa5Затраты ци снижены на ^96f5ff0,1^f7dfa5."3790  "Темное вздымающееся море"3791  "^8080ffТемное вздымающееся море^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонМощная атака, увеличивающая уровень агрессии.Наносит базовый физический урон плюс ^96f5ff%d^ffffff ед. физического урона.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^d618e7При попадании с вероятностью ^96f5ff25%%^d618e7 восстанавливает ^96f5ff800^d618e7 ед. здоровья."3800  "Светлый зарождающийся шторм"3801  "^8080ffСветлый зарождающийся шторм^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСокрушительный удар наносит противнику базовыйфизический урон, плюс ^96f5ff120%%^ffffff урона оружия, плюс ^96f5ff%d^ffffff ед. физического урона.С вероятностью ^96f5ff50%%^ffffff оглушает противника на ^96f5ff3^ffffff сек.^f7dfa5Урон от оружия увеличивается до ^96f5ff180%%^f7dfa5."*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL80 
#define __CPPGEN_GNET_SKILL80 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill80:public Skill 
    { 
    public: 
        enum { SKILL_ID = 80 }; 
        Skill80 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill80Stub:public SkillStub 
    { 
    public: 
    Skill80Stub ():SkillStub (80) 
    { 
        cls                 = 0; 
#ifdef _SKILL_CLIENT 
        name                = L"ȭ����ͨ"; 
        nativename          = "ȭ����ͨ"; 
        icon                = "ȭ����ͨ.dds"; 
#endif 
        max_level           = 10; 
        type                = 5; 
        allow_ride          = 0; 
        attr                = 0; 
        rank                = 3; 
        eventflag           = 2; 
        is_senior           = 0; 
        is_inherent         = 0; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 1137; 
        allow_forms         = 1; 
        apcost              = 0; 
        apgain              = 0; 
        doenchant           = 0; 
        dobless             = 0; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 0; 
        time_type           = 0; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 0; 
        combosk_interval    = 0; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = ""; 
        aerial_effect       = ""; 
#endif 
        range.type          = 0; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 0; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(0, 1)); 
    } 
        int GetExecutetime (Skill * skill) const
        {
            return 0;
        }
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 11800,17300,24600,34200,47000,64000,87000,118000,160000,239000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 29,34,39,44,49,54,59,64,69,74 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
        float GetRadius (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAttackdistance (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAngle (Skill * skill) const
        {
            return (float) (1 - 0.0111111 * (0));
        }
        float GetPraydistance (Skill * skill) const
        {
            return (float) (0);
        }
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
        int GetIntroduction (Skill * skill, wchar_t * buffer, int length, wchar_t * format) const
        {
            return _snwprintf (buffer, length, format, skill->GetLevel (), 6 * skill->GetLevel ());

        }
#endif 
#ifdef _SKILL_SERVER 
        int GetEnmity (Skill * skill) const
        {
            return 0;
        }
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool StateAttack (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    bool BlessMe (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        float GetEffectdistance (Skill * skill) const
        {
            return (float) (0);
        }
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    int GetAttackspeed (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool TakeEffect (Skill * skill) const
        {
            skill->GetPlayer ()->SetIncboxing (0.06 * skill->GetLevel ());
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetHitrate (Skill * skill) const
        {
            return (float) (1.0);
        }
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
