//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
11950  "Ослепление"11951  "^ffffffОслепление Уровень %d^ffcb4aДальность: ^ffffffближний бой:^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff8,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffклинок^ffcb4aСтатус: ^ffffffОпытныйУвеличение физ. силы удара.Противник получает ^96f5ff%.1f^ffffff ед. урона.Ликвидация маневра врага."18150  "Таран"18151  "^ffff00Таран^ffcb4aДальность: ^96f5ff15^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff141^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff90.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмечи, древковое оружие, топоры и молоты, без оружия^ffcb4aСтатус: ^ffffffБлагочестивыйВоин мгновенно оказывается рядом с противником и мощным ударомобездвиживает его на ^96f5ff3^ffffff сек.Наносит базовый физический урон плюс ^96f5ff120%%^ffffff урона оружия.Если уровень ЖС противника был ниже ^96f5ff50%%^ffffff, наносится ^96f5ffдвойной^ffffff урон.Этот навык не может наносить критический удар, но с вероятностью, в 2 раза превышающейшанс критического удара, наносит урон в 1,5 раза больше обычного.'Хозяин пурпурной страны смеется, все знают - идет настоящий герой'.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."18160  "Пустота - Кара богов"18161  "^80ff00Пустота - Кара богов^ffcb4aМаг. энергия: ^96f5ff495^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.Применение: ^ffffff1,7^ffcb4a сек.Перезарядка: ^ffffff180.0^ffcb4a сек.Ограничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйСоздает вокруг воина вихрь, поражающий всех противников в радиусе 10 м.Каждые 3 сек. в течение 12 сек. им наносится базовый физический урон плюс 450%% урона оружия,а их скорость передвижения уменьшается на 50%% на 3 сек. Пока воин в вихре, он не подвержен эффектам контроля, кроме паралича,и получает на 50%% меньше урона, но не может атаковать, использовать навыки или умения джинна.В зависимости от силы духа воина наносит еще 12000 - 20000 ед. урона. Умение не может нанести крит.удар,но с вероятностью в 2 раза выше шанса критического удара наносит 1,5-кратный урон.За ^96f5ff12^ffffff сек. действия восст. ^96f5ff2^ffffff ци.^a6caf0Дополнительная стоимость: ^ffffff3^a6caf0 ци."18170  "Ударная волна"18171  "^ffff00Ударная волна^ffcb4aДальность: ^ffffffближний бой^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,9^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff120,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйМожно использовать при уровне здоровья не выше ^96f5ff75%%^ffffff.Поражает всех противников перед воином на линии длиной ^96f5ff12^ffffff м.Наносит им базовый физический урон плюс ^96f5ff200%%^ffffff урона оружия и еще ^96f5ff7200^ffffff ед. физического урона.Оглушает противников на ^96f5ff3^ffffff сек. Удар всегда попадает в цель."18180  "Разгром"18181  "^ffff00Разгром^ffcb4aДальность: ^96f5ff25^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff353^ffffff^ffcb4aПодготовка: ^ffffff0,2^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,9^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff60^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйВоин бросает свое оружие в противников, оказываясь безоружным на ^96f5ff3^ffffff сек.,но также обезоруживает всех противников в радиусе ^96f5ff8^ffffff м. на ^96f5ff6^ffffff сек.Всем им наносится базовый физический урон, плюс ^96f5ff100%%^ffffff урона оружия,плюс ^96f5ff3500^ffffff ед. физического урона. Удар всегда попадает в цель.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци."18190  "Драконий аркан"18191  "^ffff00Драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff2.0^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff120.0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aСтатус: ^ffffffБлагочестивыйПритягивает противника к воину.Результат зависит от уровня и силы духа персонажей:при равном уровне шанс на успех варьируется от ^96f5ff40%%^ffffff до ^96f5ff100%%^ffffff.При равной силе духа он составляет ^96f5ff70%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."18680  "8706856"18681  "Эффект 'Пустота - Кара богов'."18710  "Кара богов"18711  "^ffff00Кара богов^ffcb4aМаг. энергия: ^96f5ff392^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,7 ^ffcb4aсек.Перезарядка: ^ffffff300.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйСоздает вокруг воина сильный вихрь, поражающий всех противников в радиусе ^96f5ff10^ffffff м.Каждые ^96f5ff3^ffffff сек. в течение ^96f5ff12^ffffff сек. им наносится базовый физический урон, плюс ^96f5ff200%%^ffffff урона оружия,плюс определенный физический урон.Пока воин в вихре, он не подвержен никаким эффектам контроля, кроме паралича, и получает на ^96f5ff50%%^ffffff меньше урона,но не может атаковать, использовать навыки или умения джинна.Дополнительный урон: ^96f5ff2500^ffffff - ^96f5ff6500^ffffff ед., зависит от силы духа персонажа.После применения за ^96f5ff12^ffffff сек. приносит ^96f5ff2^ffffff ци.^a6caf0Дополнительная стоимость: ^ffffff2,99^a6caf0 ци."18720  "8706857"18721  "Эффект 'Кары богов'."22060  "Божественный взрыв гнева"22061  "^ffff00Божественный взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. и вызывает кровотечение,которое через ^96f5ff3^ffffff сек. наносит ему ^96f5ff300%%^ffffff урона оружияплюс ^96f5ff%d^ffffff ед. физического урона.^f7dfa5Дополнительно приносит ^96f5ff0,05^f7dfa5 ци."22070  "Демонический взрыв гнева"22071  "^ffff00Демонический взрыв гнева^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНаносит противнику базовый физический урон плюс ^96f5ff2825^ffffff ед. и вызывает кровотечение,которое через ^96f5ff3^ffffff сек. наносит ему ^96f5ff300%%^ffffff урона оружияплюс ^96f5ff%d^ffffff ед. физического урона.^d618e7Урон, наносимый кровотечением, увеличивается на ^96f5ff100%%^d618e7 атаки оружием."22080  "Божественное сокрушение"22081  "^ffff00Божественное сокрушение^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйСокрушительный круговой удар наносит противникам в радиусе ^96f5ff10^ffffff м.базовый физический урон плюс ^96f5ff5416^ffffff ед. физического урона.^f7dfa5Дополнительный урон увеличивается на ^96f5ff1825^f7dfa5 ед."22090  "Демоническое сокрушение"22091  "^ffff00Демоническое сокрушение^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонСокрушительный круговой удар наносит противникам в радиусе ^96f5ff10^ffffff м.базовый физический урон, плюс ^96f5ff5416^ffffff физического урона.^d618e7Зона поражения увеличивается до ^96f5ff12^d618e7 м."22100  "Божественная неукротимая буря"22101  "^ffff00Божественная неукротимая буря^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНаносит противнику базовый физический урон, плюс ^96f5ff140%%^ffffff урона оружия, плюс^96f5ff4664^ffffff ед. физического урона и вынуждает противника атаковать воина.С вероятностью ^96f5ff55%%^ffffff оглушает противника на ^96f5ff3^ffffff сек.^f7dfa5Дополнительный урон от оружия увеличивается до ^96f5ff180%%^f7dfa5."22110  "Демоническая неукротимая буря"22111  "^ffff00Демоническая неукротимая буря^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНаносит противнику базовый физический урон, плюс ^96f5ff140%%^ffffff урона оружия, плюс^96f5ff4664^ffffff ед. физического урона и вынуждает противника атаковать воина.С вероятностью ^96f5ff55%%^ffffff оглушает противника на ^96f5ff3^ffffff сек. ^d618e7Время перезарядки сокращается на ^96f5ff1^d618e7 сек."23520  "Божественная самозарядная пушка"23521  "^ffff00Божественная самозарядная пушка^ffcb4aДальность: ^96f5ff20^ffffff ^ffcb4aм.^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffБезупречныйВнезапный удар по стоящему в отдалении противнику.Наносит базовый физический урон, плюс ^96f5ff150%%^ffffff урона оружия, плюс ^96f5ff6918^ffffff ед. физического урона.Обездвиживает цель на ^96f5ff3^ffffff сек., если она находится на расстоянии более ^96f5ff10^ffffff м.Если цель находится в пределах ^96f5ff10^ffffff м, дополнительно наносит базовый физический урон. ^f7dfa5Урон от оружия увеличивается на ^96f5ff60%%^f7dfa5, дополнительный урон - на ^96f5ff1200^f7dfa5 ед."23670  "Демоническая самозарядная пушка"23671  "^ffff00Демоническая самозарядная пушка^ffcb4aДальность: ^96f5ff20^ffffff ^ffcb4aм.^ffcb4a^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffдревковое оружие^ffcb4aСтатус: ^ffffffДемонВнезапный удар по стоящему в отдалении противнику.Наносит базовый физический урон, плюс ^96f5ff150%%^ffffff урона оружия, плюс ^96f5ff6918^ffffff ед. физического урона.Обездвиживает цель на ^96f5ff3^ffffff сек., если она находится на расстоянии более ^96f5ff10^ffffff м.Если цель находится в пределах ^96f5ff10^ffffff м, дополнительно наносит базовый физический урон.Не наносит критического урона.^d618e7Получение ци увеличивается до ^96f5ff0,2^d618e7 ци. Не промахивается."23680  "Божественный призрачный охотник"23681  "^ffff00Божественный призрачный охотник^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffБезупречныйЗапускает в противника призрачные мечи, нанося ему базовый физический урон,плюс ^96f5ff300%%^ffffff урона оружия, плюс ^96f5ff7712^ffffff ед. физического урона. Не промахивается.^f7dfa5Время подготовки сокращается на ^96f5ff0,2^f7dfa5 сек."23690  "Демонический призрачный охотник"23691  "^ffff00Демонический призрачный охотник^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff0,7 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff6,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffмечи^ffcb4aСтатус: ^ffffffДемонЗапускает в противника призрачные мечи, нанося ему базовый физический урон,плюс ^96f5ff300%%^ffffff урона оружия, плюс ^96f5ff7712^ffffff ед. физического урона. Не промахивается.^d618e7Получение ци увеличивается до ^96f5ff0,6^d618e7."23700  "Божественный крушитель небес"23701  "^ffff00Божественный крушитель небес^ffcb4aДальность: ^96f5ff8^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,3^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,3^ffcb4aОграничение по оружию: ^ffffffдревковое оружие, мечи^ffcb4aСтатус: ^ffffffПросвещенныйНевероятный удар, которым воин поражает врагов на расстоянии до ^96f5ff25^ffffff м.Наносит базовый физический урон плюс ^96f5ff5115^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff18^ffffff м. Не промахивается.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: дальность снижается до дистанции ближнего боя, дополнительно наносит ^96f5ff300%%^ffffff урона оружия.^f7dfa5При попадании прерывает умения противника."23710  "Демонический крушитель небес"23711  "^ffff00Демонический крушитель небес^ffcb4aДальность: ^96f5ff8^ffffff^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff165^ffffff^ffcb4aПодготовка: ^ffffff0,3^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,3^ffcb4aОграничение по оружию: ^ffffffдревковое оружие, мечи^ffcb4aСтатус: ^ffffffДух злаНевероятный удар, которым воин поражает врагов на расстоянии до ^96f5ff25^ffffff м.Наносит базовый физический урон плюс ^96f5ff5115^ffffff ед. физического урона.Отбрасывает монстров на ^96f5ff18^ffffff м. Не промахивается.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: дальность снижается до дистанции ближнего боя, дополнительно наносит ^96f5ff300%%^ffffff урона оружия.^d618e7На ^96f5ff8^d618e7 сек. снижает способность противников к уклонению на ^96f5ff50%%^d618e7."23720  "Божественный удар лавины"23721  "^ffff00Божественный удар лавины^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffПросвещенныйВоин обрушивает мощный, как горная лавина, удар на всех противников в радиусе ^96f5ff10^ffffff м,нанося базовый физический урон, плюс ^96f5ff165%%^ffffff урона оружия, плюс ^96f5ff7703^ffffff ед. физического урона.Скорость противников уменьшается на ^96f5ff50%%^ffffff на ^96f5ff%d^ffffff сек.С вероятностью до ^96f5ff50%%^ffffff наносит дополнительный физический урон.Эта вероятность зависит от силы духа воина.^f7dfa5С вероятностью ^96f5ff25%%^f7dfa5 повышает шанс критического удара на ^96f5ff20%%^f7dfa5 на ^96f5ff10^f7dfa5 сек."23730  "Демонический удар лавины"23731  "^ffff00Демонический удар лавины^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,4 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff5,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,12^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты^ffcb4aСтатус: ^ffffffДух злаВоин обрушивает мощный, как горная лавина, удар на всех противников в радиусе ^96f5ff10^ffffff м,нанося базовый физический урон, плюс ^96f5ff165%%^ffffff урона оружия, плюс ^96f5ff7703^ffffff ед. физического урона.Скорость противников уменьшается на ^96f5ff50%%^ffffff на ^96f5ff%d^ffffff сек.С вероятностью до ^96f5ff50%%^ffffff наносит дополнительный физический урон.Эта вероятность зависит от силы духа воина.^d618e7Эффект снижения скорости противников увеличивается до ^96f5ff65%%^d618e7."23740  "Божественный гнев дракона"23741  "^ffff00Божественный гнев дракона^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек. ^ffcb4aПерезарядка: ^ffffff15,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, древковое оружие, мечи^ffcb4aСтатус: ^ffffffБезупречныйЧудовищный удар, наносящий базовый физический урон, плюс ^96f5ff105%%^ffffff урона оружия,плюс ^96f5ff5834^ffffff ед. физического урона. Парализует противника на ^96f5ff4^ffffff сек. Не промахивается.Эффекты зависят от применяемого оружия.Топоры и молоты: время паралича увеличивается до ^96f5ff6^ffffff сек.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: не парализует цель. Время подготовки сокращается до ^96f5ff0,2^ffffff сек., время применения - до ^96f5ff1,4^ffffff сек.Добавляется ^96f5ff300%%^ffffff урона оружия.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^f7dfa5С вероятностью 35%% восстанавливает ^96f5ff1^f7dfa5 ци."23750  "Демонический гнев дракона"23751  "^ffff00Демонический гнев дракона^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff140^ffffff^ffcb4aПодготовка: ^ffffff0,4^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffтопоры и молоты, древковое оружие, мечи^ffcb4aСтатус: ^ffffffДемонЧудовищный удар, наносящий базовый физический урон, плюс ^96f5ff105%%^ffffff урона оружия,плюс ^96f5ff5834^ffffff ед. физического урона. Парализует противника на ^96f5ff4^ffffff сек. Не промахивается.Эффекты зависят от применяемого оружия.Топоры и молоты: время паралича увеличивается до ^96f5ff7^ffffff сек.Древковое оружие: дальность увеличивается до ^96f5ff20^ffffff м. Добавляется ^96f5ff100%%^ffffff урона оружия.Мечи: не парализует цель. Время подготовки сокращается до ^96f5ff0,2^ffffff сек., время применения - до ^96f5ff1,4^ffffff сек.Добавляется ^96f5ff300%%^ffffff урона оружия.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци.^d618e7Время паралича увеличено на ^96f5ff1,5^d618e7 сек."31930  "Таинственный драконий аркан"31931  "^ffff00Таинственный драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff120^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aСтатус: ^ffffffБлагочестивыйПритягивает к воину врагов в радиусе ^96f5ff8^ffffff м. от цели.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."31940  "Божественный львиный рык"31941  "^ffff00Божественный львиный рык^ffcb4aДальность: ^ffffff5 м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйЯростный рык оглушает всех врагов в радиусе ^96f5ff10^ffffff м на ^96f5ff6^ffffff сек.^96f5ffЧем выше уровень умения, тем больше шансы на успех.^ffffffВсе враги в радиусе ^96f5ff10^ffffff м будут обезоружены на ^96f5ff6^ffffff сек.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Умение поражает цель, оглушая и обезоруживая ее на ^96f5ff5^ffffff сек.Мечи: не оглушает и не обезоруживает цели. Время подготовки сокращается до ^96f5ff0,1^ffffff сек., время применения - до ^96f5ff1,0^ffffff сек.Наносит противникам в радиусе ^96f5ff10^ffffff м ^96f5ff200%%^ffffff урона оружия. Не может нанести критический урон, но с вероятностью, в 2 разапревышающей шанс критического удара, наносит ^96f5ffполуторакратный^ffffff урон.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци.^f7dfa5Затраты ци снижаются на ^96f5ff0,15^f7dfa5."31950  "Демонический львиный рык"31951  "^ffff00Демонический львиный рык^ffcb4aДальность: ^ffffff5 м^ffcb4aМаг. энергия: ^96f5ff%d^ffcb4aПодготовка: ^ffffff0,6 ^ffcb4aсек.Применение: ^ffffff1,2 ^ffcb4aсек.Перезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.Ограничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонЯростный рык оглушает всех врагов в радиусе ^96f5ff10^ffffff м на ^96f5ff6^ffffff сек.^96f5ffЧем выше уровень умения, тем больше шансы на успех.^ffffffВсе враги в радиусе ^96f5ff10^ffffff м будут обезоружены на ^96f5ff6^ffffff сек.Эффекты зависят от применяемого оружия.Древковое оружие: дальность повышается до ^96f5ff20^ffffff м. Умение поражает цель, оглушая и обезоруживая ее на ^96f5ff5^ffffff сек.Мечи: не оглушает и не обезоруживает цели. Время подготовки сокращается до ^96f5ff0,1^ffffff сек., время применения - до ^96f5ff1,0^ffffff сек.Наносит противникам в радиусе ^96f5ff10^ffffff м ^96f5ff200%%^ffffff урона оружия. Не может нанести критический урон, но с вероятностью, в 2 разапревышающей шанс критического удара, наносит ^96f5ffполуторакратный^ffffff урон.^a6caf0Дополнительная стоимость: ^ffffff0,35^a6caf0 ци.^d618e7Перезарядка сокращена на 1 сек. Умение срабатывает всегда."*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL195 
#define __CPPGEN_GNET_SKILL195 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill195:public Skill 
    { 
    public: 
        enum { SKILL_ID = 195 }; 
        Skill195 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill195Stub:public SkillStub 
    { 
    public: 
#ifdef _SKILL_SERVER 
        class State1:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 200;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetDecmp (0.2 * (-1.6 + 4 * skill->GetLevel ()));
                skill->GetPlayer ()->SetPray (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 1;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State2:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 800;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetDecmp (0.8 * (-1.6 + 4 * skill->GetLevel ()));
                skill->SetPlus (0);
                skill->SetRatio (0);
                skill->SetDamage (skill->GetAttack ());
                skill->GetPlayer ()->SetPerform (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State3:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 0;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
    Skill195Stub ():SkillStub (195) 
    { 
        cls                 = 4; 
#ifdef _SKILL_CLIENT 
        name                = L"��ɱ"; 
        nativename          = "��ɱ"; 
        icon                = "��ɱ.dds"; 
#endif 
        max_level           = 10; 
        type                = 1; 
        allow_ride          = 0; 
        attr                = 1; 
        rank                = 0; 
        eventflag           = 4; 
        is_senior           = 0; 
        is_inherent         = 0; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 1502; 
        allow_forms         = 1; 
        apcost              = 0; 
        apgain              = 5; 
        doenchant           = 1; 
        dobless             = 0; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 1; 
        time_type           = 0; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 0; 
        combosk_interval    = 0; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = "��ɱ.sgc"; 
        aerial_effect       = ""; 
#endif 
        range.type          = 0; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 0; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(102, 1)); 
        restrict_weapons.push_back (9); 
#ifdef _SKILL_SERVER 
        statestub.push_back (new State1 ()); 
        statestub.push_back (new State2 ()); 
        statestub.push_back (new State3 ()); 
#endif 
    } 
        int GetExecutetime (Skill * skill) const
        {
            return 800;
        }
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 8000,8000,8000,8000,8000,8000,8000,8000,8000,8000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 100,800,2100,4100,7000,10900,16100,23000,32000,44100 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 3,8,13,18,23,28,33,38,43,48 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
        float GetRadius (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAttackdistance (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAngle (Skill * skill) const
        {
            return (float) (1 - 0.0111111 * (0));
        }
        float GetPraydistance (Skill * skill) const
        {
            return (float) (skill->GetPlayer ()->GetRange ());
        }
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 2,6,10,14,18,22,26,30,34,38 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
        int GetIntroduction (Skill * skill, wchar_t * buffer, int length, wchar_t * format) const
        {
            return _snwprintf (buffer, length, format,
                               skill->GetLevel (),
                               -1.6 + 4 * skill->GetLevel (), 4.8 * skill->GetLevel () * skill->GetLevel () + 103 * skill->GetLevel () + 72.5);

        }
#endif 
#ifdef _SKILL_SERVER 
        int GetEnmity (Skill * skill) const
        {
            return 0;
        }
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool StateAttack (Skill * skill) const
        {
            skill->GetVictim ()->SetProbability (1.0 * 100);
            skill->GetVictim ()->SetTime (15000);
            skill->GetVictim ()->SetAmount (4.8 * skill->GetLevel () * skill->GetLevel () + 103 * skill->GetLevel () + 72.5);
            skill->GetVictim ()->SetBleeding (1);
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
    bool BlessMe (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        float GetEffectdistance (Skill * skill) const
        {
            return (float) (12.5);
        }
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        int GetAttackspeed (Skill * skill) const
        {
            return 3;
        }
#endif 
#ifdef _SKILL_SERVER 
        bool TakeEffect (Skill * skill) const
        {;
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetHitrate (Skill * skill) const
        {
            return (float) (1.2 + 0.05 * skill->GetLevel ());
        }
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
