//Skill Parser (c)Deadraky 2023 

/* SKILL DESCRIPTION BEGIN */ 
/* 
54420  "Таинственная грозовая вспышка"54421  "^ffff00Таинственная грозовая вспышка^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff2 ^ffcb4aмин.^ffcb4aОграничение по оружию: ^ffffffмечи, кастеты^ffcb4aСтатус: ^ffffffСын адаНаносит противнику ^96f5ff200%%^ffffff базового физического урона. Не промахивается.Дополнительные эффекты зависят от вида применяемого оружия.Мечи: добавляется еще ^96f5ff40%%^ffffff базового физического урона.Кастеты: обездвиживает цель на ^96f5ff5^ffffff сек., добавляется еще ^96f5ff80%%^ffffff базового физического урона.Тип урона меняется на смешанный физический урон и урон стихией металла.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."54470  "Божественное небо без тени"54471  "^ffff00Божественное небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aСтатус: ^ffffffПросвещенныйКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff15^ffffff сек. повышает скорость атаки воина на ^96f5ff15%%^ffffff. Прерывает применение умений.^f7dfa5Время ускорения атаки увеличивается на ^96f5ff5^f7dfa5 сек."54480  "Демоническое небо без тени"54481  "^ffff00Демоническое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aСтатус: ^ffffffДух злаКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff15^ffffff сек. повышает скорость атаки воина на ^96f5ff15%%^ffffff. Прерывает применение умений.^d618e7Скорость атаки увеличивается до ^96f5ff20%%^d618e7."54490  "Великое небо без тени"54491  "^ff5c00Великое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff20^ffffff сек. повышает скорость атаки воина на ^96f5ff20%%^ffffff. Прерывает применение умений."54500  "Великое небо без тени"54501  "^ff5c00Великое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff20^ffffff сек. повышает скорость атаки воина на ^96f5ff20%%^ffffff. Прерывает применение умений.^ffcb4aЭффект золотой руны:@1^ffcb4a1-4 ур.: добавляется ^96f5ff40%%^ffcb4a урона оружия^ffcb4a5-7 ур.: добавляется ^96f5ff60%%^ffcb4a урона оружия^ffcb4a8-9 ур.: добавляется ^96f5ff80%%^ffcb4a урона оружия ^ffcb4a10 ур.: добавляется ^96f5ff100%%^ffcb4a урона оружия@1@2^ffcb4aДобавляется ^96f5ff%d%%^ffcb4a урона оружия.@2"54510  "Великое небо без тени"54511  "^ff5c00Великое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff20^ffffff сек. повышает скорость атаки воина на ^96f5ff20%%^ffffff. Прерывает применение умений.^00ff00Эффект изумрудной руны:@1^00ff001-4 ур.: время применения уменьшается до ^96f5ff1,1^00ff00 сек.^00ff005-7 ур.: время применения уменьшается до ^96f5ff1,0^00ff00 сек.^00ff008-9 ур.: время применения уменьшается до ^96f5ff0,9^00ff00 сек. ^00ff0010 ур.: время применения уменьшается до ^96f5ff0,8^00ff00 сек.@1@2^00ff00Время применения уменьшается до ^96f5ff%.1f^00ff00 сек.@2"54520  "Великое небо без тени"54521  "^ff5c00Великое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff20^ffffff сек. повышает скорость атаки воина на ^96f5ff20%%^ffffff. Прерывает применение умений.^00ffffЭффект сапфировой руны:@1^00ffff1-4 ур.: получение ци увеличивается до ^ffffff0,15^00ffff5-7 ур.: получение ци увеличивается до ^ffffff0,2^00ffff8-9 ур.: получение ци увеличивается до ^ffffff0,25 ^00ffff10 ур.: получение ци увеличивается до ^ffffff0,3@1@2^00ffffПолучение ци увеличивается до ^ffffff0,%d^00ffff.@2"54530  "Великое небо без тени"54531  "^ff5c00Великое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.Применение: ^ffffff1,2 ^ffcb4aсек.Перезарядка: ^ffffff12,0 ^ffcb4aсек.Получение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.На ^96f5ff20^ffffff сек. повышает скорость атаки воина на ^96f5ff20%%^ffffff. Прерывает применение умений.^ff0000Эффект рубиновой руны:@1^ff0000Расходуется ^96f5ff50%%^ff0000 от текущей ци, за каждую 0,01 ци меткость повышается на ^96f5ff10%%^ff0000.При отсутствии ци не наносит урон.^ff00001-4 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff125%%^ff0000 урона^ff00005-7 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff150%%^ff0000 урона^ff00008-9 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff175%%^ff0000 урона ^ff000010 ур.: при каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff200%%^ff0000 урона@1@2^ff0000Расходуется ^96f5ff50%%^ff0000 от текущей ци, за каждую 0,01 ци меткость повышается на ^96f5ff10%%^ff0000.При каждом расходе ^96f5ff1^ff0000 ци наносится ^96f5ff%d%%^ff0000 урона.При отсутствии ци не наносит урон.@2"54540  "Великое небо без тени"54541  "^ff5c00Великое небо без тени^ffcb4aДальность: ^ffffffближний бой^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,2 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff12,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffкастеты, без оружия^ffcb4aХарактеристика: ^ff5c00Мощь^ffcb4aСтатус: ^ffffffАсураКруговой удар в прыжке, наносящий противникам в радиусе ^96f5ff8^ffffff м базовый физический урон,плюс ^96f5ff100%%^ffffff урона оружия, плюс ^96f5ff3233^ffffff ед. смешанного физического урона и урона стихией металла.^ffeaabЭффект серебряной руны:@1^ffeaab1-4 ур.: добавляется ^96f5ff120%%^ffeaab урона оружия^ffeaab5-7 ур.: добавляется ^96f5ff180%%^ffeaab урона оружия^ffeaab8-9 ур.: добавляется ^96f5ff240%%^ffeaab урона оружия ^ffeaab10 ур.: добавляется ^96f5ff300%%^ffeaab урона оружия@1@2^ffeaabДобавляется ^96f5ff%d%%^ffeaab урона оружия.@2"63660  "Эффект от умения 'Создатель'"63661  "Эффект от умения 'Создатель'"63670  "Таинственный парящий дракон"63671  "^ffff00Таинственный парящий дракон  Уровень %d^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйБыстрый прыжок назад на ^96f5ff%d^ffffff м.Во время прыжка персонаж невосприимчив к большей части урона.^a6caf0Дополнительная стоимость: ^ffffff0,1^a6caf0 ци."63680  "Таинственный прыжок тигра"63681  "^ffff00Таинственный прыжок тигра  Уровень %d^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^96f5ff%.1f^ffffff^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБлагочестивыйВнезапный рывок вперед. Персонаж появляется в ^96f5ff%d ^ffffffм. впереди.Во время рывка персонаж невосприимчив к наложению негативных эффектов.^a6caf0Дополнительная стоимость: ^ffffff0,1^a6caf0 ци."63690  "Таинственный драконоборец"63691  "^ffff00Таинственный драконоборец^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff5 ^ffcb4aмин.^ffcb4aОграничение по оружию: ^ffffffнет^ffcb4aСтатус: ^ffffffБлагочестивыйВеликий воин изобрел этот прием в бою с драконом.Он смог не только победить монстра, но и запомнить технику удара,а затем научил этой технике других, назвав ее 'Драконоборец'.Полностью восстанавливает весь запас ци и повышает шанс критического удара на ^96f5ff25%%^ffffff на ^96f5ff30^ffffff сек. ^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."63700  "Божественная сутра о внутреннем"63701  "^ffff00Божественная сутра о внутреннем^ffcb4aМаг. энергия: ^ffffff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНа ^96f5ff30^ffffff мин. повышает магическую защиту на ^96f5ff150%%^ffffff,но снижает физическую защиту на ^96f5ff120%%^ffffff.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно.^f7dfa5Бонус к магической защите увеличивается до ^96f5ff180%%^f7dfa5."63710  "Демоническая сутра о внутреннем"63711  "^ffff00Демоническая сутра о внутреннем^ffcb4aМаг. энергия: ^ffffff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНа ^96f5ff30^ffffff мин. повышает магическую защиту на ^96f5ff150%%^ffffff,но снижает физическую защиту на ^96f5ff120%%^ffffff.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно.^d618e7Снижает физическую защиту лишь на ^96f5ff90%%^d618e7."63720  "Божественная сутра о внешнем"63721  "^ffff00Божественная сутра о внешнем^ffcb4aМаг. энергия: ^ffffff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffБезупречныйНа ^96f5ff30^ffffff мин. повышает физическую защиту на ^96f5ff150%%^ffffff,но снижает магическую защиту на ^96f5ff120%%^ffffff.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно.^f7dfa5Бонус к физической защите увеличивается до ^96f5ff180%%^f7dfa5."63730  "Демоническая сутра о внешнем"63731  "^ffff00Демоническая сутра о внешнем^ffcb4aМаг. энергия: ^96f5ff20^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff10 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,5^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя^ffcb4aСтатус: ^ffffffДемонНа ^96f5ff30^ffffff мин. повышает физическую защиту на ^96f5ff150%%^ffffff,но снижает магическую защиту на ^96f5ff120%%^ffffff.^a6caf0'Сутру о внешнем' и 'Сутру о внутреннем' нельзя использовать одновременно.^d618e7Снижает магическую защиту лишь на ^96f5ff90%%^d618e7."63740  "Великий драконий аркан"63741  "^ff5c00Великий драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff90^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffМудрецПритягивает к воину врагов в радиусе ^96f5ff8^ffffff м. от цели.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци."63750  "Великий драконий аркан"63751  "^ff5c00Великий драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff90^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffМудрецПритягивает одного врага к воину и наносит ему базовый физический урон, плюс ^96f5ff300%%^ffffff урона оружия,плюс ^96f5ff7880^ffffff ед. физического урона. Парализует цель на ^96f5ff3^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци.^ffcb4aЭффект золотой руны:@1^ffcb4a1-4 ур.: добавляется ^96f5ff40%%^ffcb4a урона оружия^ffcb4a5-7 ур.: добавляется ^96f5ff60%%^ffcb4a урона оружия^ffcb4a8-9 ур.: добавляется ^96f5ff80%%^ffcb4a урона оружия^ffcb4a 10 ур.: добавляется ^96f5ff100%%^ffcb4a урона оружия@1@2^ffcb4aК наносимому урону добавляется ^96f5ff%d%%^ffcb4a урона оружия.@2"63760  "Великий драконий аркан"63761  "^ff5c00Великий драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff90^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffМудрецПритягивает к воину врагов в радиусе ^96f5ff8^ffffff м. от цели.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци.^00ff00Эффект изумрудной руны:@1^00ff001-4 ур.: радиус действия увеличивается до ^96f5ff9^00ff00 м.^00ff005-7 ур.: радиус действия увеличивается до ^96f5ff10^00ff00 м.^00ff008-9 ур.: радиус действия увеличивается до ^96f5ff11^00ff00 м. ^00ff0010 ур.: радиус действия увеличивается до ^96f5ff12^00ff00 м.@1@2Радиус действия увеличивается до ^96f5ff%d^00ff00 м.@2"63770  "Великий драконий аркан"63771  "^ff5c00Великий драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff90^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffМудрецПритягивает к воину врагов в радиусе ^96f5ff8^ffffff м. от цели.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци.^00ffffЭффект сапфировой руны@1^00ffff1-4 ур.: после применения восстанавливается ^ffffff0,2^00ffff ци^00ffff5-7 ур.: после применения восстанавливается ^ffffff0,3^00ffff ци^00ffff8-9 ур.: после применения восстанавливается ^ffffff0,4^00ffff ци^00ffff 10 ур.: после применения восстанавливается ^ffffff0,5^00ffff ци@1@2^00ffffПосле применения восстанавливается ^ffffff0,%d^00ffff ци.@2"63780  "Великий драконий аркан"63781  "^ff5c00Великий драконий аркан^ffcb4aДальность: ^96f5ff25^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff90^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffМудрецПритягивает к воину врагов в радиусе ^96f5ff8^ffffff м. от цели.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци.^ff0000Эффект рубиновой руны@1^ff00001-4 ур.: перезарядка сокращается на ^96f5ff12^ff0000 сек.^ff00005-7 ур.: перезарядка сокращается на ^96f5ff18^ff0000 сек.^ff00008-9 ур.: перезарядка сокращается на ^96f5ff24^ff0000 сек.^ff0000 10 ур.: перезарядка сокращается на ^96f5ff30^ff0000 сек.@1@2^ff0000Время перезарядки сокращается на ^96f5ff%d^ff0000 сек.@2"63790  "Великий драконий аркан"63791  "^ff5c00Великий драконий аркан^ffcb4aДальность: ^96f5ff8^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff212^ffffff^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff90^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffоружие ближнего боя, без оружия^ffcb4aХарактеристика: ^ff5c00Мудрость^ffcb4aСтатус: ^ffffffМудрецПритягивает к воину врагов в радиусе ^96f5ff10^ffffff м. от него самого.^a6caf0Дополнительная стоимость: ^ffffff0,5^a6caf0 ци.^ffeaabЭффект серебряной руны:@1^ffeaab1-4 ур.: радиус действия увеличивается до ^96f5ff12^ffeaab м.^ffeaab5-7 ур.: радиус действия увеличивается до ^96f5ff15^ffeaab м.^ffeaab8-9 ур.: радиус действия увеличивается до ^96f5ff18^ffeaab м. ^ffeaab10 ур.: радиус действия увеличивается до ^96f5ff21^ffeaab м.@1@2^ffeaabРадиус действия увеличивается до ^96f5ff%d^ffeaab м.@2"70  "Пламенный фонарь"71  "^ffffffПламенный фонарь Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЛюбопытныйСжигает противника в ярком пламени.Наносит базовый магический урон плюс ^96f5ff%.1f^ffffff ед. урона стихией огня за ^96f5ff15^ffffff сек."80  "Жертвоприношение"81  "^ffffffЖертвоприношение Уровень %d^ffcb4aДальность: ^ffffff6^ffcb4a м.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffffконцентрация силы^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЖестокийЖертвуя своей кровью, персонаж устраивает взрыв, поражающий всех окружающих противников.Подготовка может длиться до ^96f5ff%.1f^ffffff сек., при этом жертвуется до ^96f5ff60%%^ffffff здоровья.Всем противникам в радиусе ^96f5ff12^ffffff м наносит ^96f5ff%d^ffffff ед. урона от огня плюс^96f5ff%.1f^ffffff за каждую пожертвованную единицу здоровья."90  "Знание стихии воды"91  "^ffffffЗнание стихии воды Уровень %d^ffcb4aПассивный навык^ffcb4aСтатус: ^ffffffРассудительный^ffffffУрон от атак водой увеличен на ^96f5ff%d%%^ffffff."100  "Ускользающая земля"101  "^ffffffУскользающая земля Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffОпытныйМаг зачаровывает землю, и она уходит из-под ног противника.Наносит базовый магический урон и ^96f5ff%.1f^ffffff дополнительного урона стихией земли за ^96f5ff15^ffffff сек.Снижает скорость противника на ^96f5ff15%%^ffffff, а с вероятностью ^96f5ff%d%%^ffffff и вовсе обездвиживает его на ^96f5ff3^ffffff сек."530  "Знание стихии огня"531  "^ffffffЗнание стихии огня Уровень %d^ffcb4aПассивный навык^ffcb4aСтатус: ^ffffffРассудительный^ffffffУрон от атак огнем увеличен на ^96f5ff%d%%^ffffff."810  "Огненное клеймо"811  "^ffffffОгненное клеймо Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,5^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffСтойкийПодчиняет заклейменного противника воле мага,нанося базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%.1f^ffffff ед. урона стихией огня."840  "Крылья феникса"841  "^ffffffКрылья феникса Уровень %d^ffcb4aДальность: ^ffffff10^ffcb4a м.^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff8,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗагадочныйМаг призывает феникса, который атакует всех противников на линии длиной^96f5ff%.1f^ffffff м и отбрасывает их на ^96f5ff%.1f^ffffff м.Наносит базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%.1f^ffffff ед. урона стихией огня.Отталкивание не действует на игроков."850  "Священное пламя"851  "^ffffffСвященное пламя Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffОпытныйИспользуя священную силу огня, маг поражает противника,нанося ему базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс^96f5ff%.1f^ffffff ед. урона стихией огня."860  "Огненная буря"861  "^ffffffОгненная буря Уровень %d^ffcb4aДальность: ^ffffff6^ffcb4a м.^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffРассудительныйМаг создает кольцо пламени радиусом ^96f5ff12^ffffff м.Каждые ^96f5ff3^ffffff сек. оно расходует ^96f5ff%d^ffffff ед. МЭ.Наносит базовый магический урон плюс ^96f5ff%.1f^ffffff ед. урона стихией огня.Кольцо горит, пока не кончится МЭ или пока маг не отменит заклинание.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."870  "Огненный ливень"871  "^ffffffОгненный ливень Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff4,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗлойМаг призывает множество пламенных клинков, которые обрушиваются на врагов смертоносным ливнем.Наносит всем противникам в радиусе ^96f5ff%.1f^ffffff м базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%.1f^ffffff ед. Урон считается физическим и огненным.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци."880  "Бьющий ключ"881  "^ffffffБьющий ключ Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffСтойкийИз земли вырывается горячий гейзер, ошпаривающий врага. Наносит базовый магический урон,плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%.1f^ffffff ед. урона стихией воды.С вероятностью ^96f5ff%d%%^ffffff замедляет противника на ^96f5ff40%%^ffffff. Эффект длится ^96f5ff%.1f^ffffff сек."890  "Сосредоточение"891  "^ffffffСосредоточение Уровень %d^ffcb4aМаг. энергия: ^96f5ff100^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffРассудительныйСтихия воды помогает магу увеличить энергию.На ^96f5ff%d^ffffff минут максимум МЭ вырастает на ^96f5ff%d%%^ffffff.^a6caf0Дополнительная стоимость: ^ffffff1^a6caf0 ци."900  "Утренняя роса"901  "^ffffffУтренняя роса Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff4.5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffОпытныйИспользуя энергию воды, маг восстанавливает одной цели ^96f5ff%d^ffffff ед. здоровьяплюс ^96f5ff%d%%^ffffff от силы базовой магической атаки."910  "Обморожение"911  "^ffffffОбморожение Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗагадочныйНа ^96f5ff15^ffffff мин. наделяет оружие союзника пронизывающей силой холода, и оно наносит дополнительные ^96f5ff%d%%^ffffff урона стихией воды."920  "Смертоносный град"921  "^ffffffСмертоносный град Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff2.5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff15,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,2^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЖестокийМаг обрушивает на противника ледяной град, нанося базовый магический урон,плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%.1f^ffffff ед. урона стихией воды.С вероятностью ^96f5ff%d%%^ffffff замедляет противника на ^96f5ff80%%^ffffff на ^96f5ff%.1f^ffffff сек."930  "Ярость водного дракона"931  "^ffffffЯрость водного дракона Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff4,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,6 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff30.0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗлойМогучий водный дракон спускается с небес, сокрушая всех противников в радиусе ^96f5ff%.1f^ffffff м.Наносит базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс ^96f5ff%.1f^ffffff ед. урона стихией воды.С вероятностью ^96f5ff%d%%^ffffff замедляет противников на ^96f5ff60%%^ffffff. Эффект длится ^96f5ff%.1f^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци."940  "*"941  "Ливень"950  "＊"951  "Водная Имана"960  "Огненный доспех"961  "^ffffffОгненный доспех Уровень %d^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЛюбопытныйМаг укрывает себя пеленой пламени, котораяповышает защиту от огня на ^96f5ff%d%%^ffffff и восстанавливает ^96f5ff%d^ffffff ед. здоровья каждую секунду в течение ^96f5ff15^ffffff мин.^a6caf0Маг не может использовать разные виды доспехов одновременно.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци."970  "Камнепад"971  "^ffffffКамнепад Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff1,6 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,4 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffСтойкийМаг призывает на голову противника каменную глыбу.Наносит базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%.1f^ffffff ед. урона стихией земли."980  "Песчаная буря"981  "^ffffffПесчаная буря Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff2.5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,5^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff6,0^ffcb4a сек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗагадочныйМаг призывает песчаную бурю, и миллионы острых песчинокнаносят врагам базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия, плюс^96f5ff%.1f^ffffff ед. урона стихией земли.Снижает меткость противников на ^96f5ff%d%%^ffffff на ^96f5ff10^ffffff сек."990  "Сила гор"991  "^ffffffСила гор Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffffff ^ffcb4aм^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff5,0^ffcb4a сек.^ffcb4aПрименение: ^ffffff1,4^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff30,0^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗлойМаг призывает огромную скалу и сбрасывает ее на противников.Всем противникам в круге радиусом ^96f5ff%.1f^ffffff м наноситсябазовый урон плюс ^96f5ff%d%%^ffffff урона оружия и еще ^96f5ff%.1f^ffffff ед. урона от земли.С вероятностью ^96f5ff%d%%^ffffff оглушает всех противников на ^96f5ff%.1f^ffffff сек.^a6caf0Дополнительная стоимость: ^ffffff2^a6caf0 ци."1000  "Сдвиг земли"1001  "^ffffffСдвиг земли Уровень %d^ffcb4aМаг. энергия: ^96f5ff50^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^96f5ff%d^ffffff^ffcb4a сек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffРассудительныйПризвав силу духов земли, маг мгновенно переносится на ^96f5ff%d^ffffff м. вперед.^a6caf0Дополнительная стоимость: ^ffffff0,2^a6caf0 ци."1010  "Знание стихии земли"1011  "^ffffffЗнание стихии земли Уровень %d^ffcb4aПассивный навык^ffcb4aСтатус: ^ffffffРассудительный^ffffffУрон от атак землей увеличен на ^96f5ff%d%%^ffffff."1800  "Ледяной доспех"1801  "^ffffffЛедяной доспех Уровень %d^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЛюбопытныйМаг укрывает себя ледяной завесой, которая увеличивает защиту от воды на ^96f5ff%d%%^ffffffи восстанавливает ^96f5ff%d^ffffff ед. МЭ в секунду в течение ^96f5ff15^ffffff мин.^a6caf0Маг не может использовать разные виды доспехов одновременно.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци."1810  "Земляной доспех"1811  "^ffffffЗемляной доспех Уровень %d^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЛюбопытныйМаг окружает себя стеной, которая увеличивает защиту от земли на ^96f5ff%d%%^ffffffи дает дополнительные ^96f5ff%d%%^ffffff физической защиты на ^96f5ff15^ffffff мин.^a6caf0Маг не может использовать разные виды доспехов одновременно.Дополнительная стоимость: ^ffffff0,3^a6caf0 ци."1820  "Ливень"1821  "^ffffffЛивень Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%.1f^ffffff^ffcb4aПодготовка: ^ffffff1,8 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff12,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,05^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЛюбопытныйМаг обрушивает на окружающих противников смертоносный ливень,нанося базовый магический урон плюс ^96f5ff%.1f^ffffff ед. урона стихией воды.С вероятностью ^96f5ff33%%^ffffff обездвиживает противников на ^96f5ff%.1f^ffffff сек.^96f5ffЧем выше уровень, тем больше зона поражения^ffffff."1830  "Сутра о душе"1831  "^ffffffСутра о душе^ffcb4aПодготовка: ^ffffffмгновенно^ffcb4aПерезарядка: ^ffffff60,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЗлойПереводит 2 ци в ^96f5ff10%%^ffffff от максимального запаса МЭ мага.В течение ^96f5ff6^ffffff сек. подготовка всех заклинаний мага становится практически мгновенной."1840  "Несогласие"1841  "^ffffffНесогласие Уровень %d^ffcb4aДальность: ^96f5ff%.1f^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff0,5 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff2,0 ^ffcb4aсек.^ffcb4aПерезарядка: ^96f5ff%d^ffffff ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,1^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffЖестокийСоздает сферу из чистой энергии, которая обессиливает противника,прерывая подготовку заклинаний и запрещая применять их на ^96f5ff%.1f^ffffff сек."2280  "Вспышка ци"2281  "^ffffffВспышка ци^ffcb4aСтатус: ^ffffffРассудительныйСжигая ци, персонаж повышает силу своей магической атаки на 200%% урона оружия на 10 сек.Кроме того, в течение 1 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff1^a6caf0 ци."2290  "Высшая вспышка ци"2291  "^ffffffВысшая вспышка ци^ffcb4aСтатус: ^ffffffЗлойСжигая ци, персонаж получает 10%% от максимального запаса МЭи повышает силу своей магической атаки на 400%% урона оружия на 12 сек.Кроме того, в течение 2 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff2^a6caf0 ци."3640  "Вспышка бессмертного"3641  "^ffffffВспышка бессмертного^ffcb4aСтатус: ^ffffffБезупречныйСжигая ци, персонаж получает 20%% от максимального запаса ЖС,и повышает силу своей магической атаки на 700%% урона оружия,а также снижает получаемый урон на 25%% на 15 сек.Кроме того, в течение 3 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff3^a6caf0 ци."3650  "Вспышка демона"3651  "^ffffffВспышка демона^ffcb4aСтатус: ^ffffffДемонСжигая ци, персонаж получает 20%% от максимального запаса МЭ,и повышает силу своей магической атаки на 700%% урона оружия,а время подготовки заклинаний сокращается на 25%% на 15 сек.Кроме того, в течение 3 сек. персонаж будет неуязвим.^a6caf0Стоимость: ^ffffff3^a6caf0 ци."4400  "Светлое огненное клеймо"4401  "^8080ffСветлое огненное клеймо^ffcb4aДальность: ^96f5ff%d^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,5^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffБезупречныйПодчиняет заклейменного противника воле мага,нанося базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%d^ffffff ед. урона стихией огня.^f7dfa5С вероятностью ^96f5ff20%%^f7dfa5 дополнительно приносит ^96f5ff0,3^f7dfa5 ци."4410  "Темное огненное клеймо"4411  "^8080ffТемное огненное клеймо^ffcb4aДальность: ^96f5ff%d^ffcb4a м^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,5^ffcb4a сек.^ffcb4aПрименение: ^ffffff0,8 ^ffcb4aсек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aПолучение ци: ^ffffff0,15^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffДемонПодчиняет заклейменного противника воле мага,нанося базовый магический урон, плюс ^96f5ff%d%%^ffffff урона оружия,плюс ^96f5ff%d^ffffff ед. урона стихией огня.^d618e7Время подготовки сокращается до ^96f5ff1,2^d618e7 сек."4420  "Светлый огненный доспех"4421  "^8080ffСветлый огненный доспех^ffcb4aМаг. энергия: ^96f5ff%d^ffffff^ffcb4aПодготовка: ^ffffff1,0 ^ffcb4aсек.^ffcb4aПрименение: ^ffffff1,2^ffcb4a сек.^ffcb4aПерезарядка: ^ffffff3,0 ^ffcb4aсек.^ffcb4aОграничение по оружию: ^ffffffмагическое оружие, без оружия^ffcb4aСтатус: ^ffffffБезупречныйМаг укрывает себя пеленой пламени, которая повышет защиту от огня на ^96f5ff120%%^ffffffи восстанавливает ^96f5ff12^ffffff ед. здоровья каждую секунду в течение ^96f5ff15^ffffff мин.^a6caf0Маг не может использовать разные виды доспехов одновременно.^a6caf0Дополнительная стоимость: ^ffffff0,3^a6caf0 ци.^f7dfa5Защита от огня повышается до ^96f5ff150%%^f7dfa5."*/ 
/* SKILL DESCRIPTION END */ 

#ifndef __CPPGEN_GNET_SKILL442 
#define __CPPGEN_GNET_SKILL442 
namespace GNET 
{ 
#ifdef _SKILL_SERVER 
    class Skill442:public Skill 
    { 
    public: 
        enum { SKILL_ID = 442 }; 
        Skill442 ():Skill (SKILL_ID){ } 
    }; 
#endif 
    class Skill442Stub:public SkillStub 
    { 
    public: 
#ifdef _SKILL_SERVER 
        class State1:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 1000;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetDecmp (53);
                skill->GetPlayer ()->SetPray (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return skill->GetRand () < 5;
            }
            bool Cancel (Skill * skill) const
            {
                return 1;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State2:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 1200;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
                skill->GetPlayer ()->SetDecmp (212);
                skill->GetPlayer ()->SetPerform (1);
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
#ifdef _SKILL_SERVER 
        class State3:public SkillStub::State
        {
          public:
            int GetTime (Skill * skill) const
            {
                return 0;
            }
            bool Quit (Skill * skill) const
            {
                return false;
            }
            bool Loop (Skill * skill) const
            {
                return false;
            }
            bool Bypass (Skill * skill) const
            {
                return false;
            }
            void Calculate (Skill * skill) const
            {
            }
            bool Interrupt (Skill * skill) const
            {
                return false;
            }
            bool Cancel (Skill * skill) const
            {
                return 0;
            }
            bool Skip (Skill * skill) const
            {
                return 0;
            }
        };
#endif 
    Skill442Stub ():SkillStub (442) 
    { 
        cls                 = 1; 
#ifdef _SKILL_CLIENT 
        name                = L"�桤���滤��"; 
        nativename          = "�桤���滤��"; 
        icon                = "���滤��1.dds"; 
#endif 
        max_level           = 1; 
        type                = 2; 
        allow_ride          = 0; 
        attr                = 0; 
        rank                = 20; 
        eventflag           = 0; 
        is_senior           = 1; 
        is_inherent         = 0; 
        is_movingcast       = 0; 
        npcdelay            = 0; 
        showorder           = 1202; 
        allow_forms         = 1; 
        apcost              = 30; 
        apgain              = 0; 
        doenchant           = 1; 
        dobless             = 0; 
        arrowcost           = 0; 
        allow_land          = 1; 
        allow_air           = 1; 
        allow_water         = 1; 
        notuse_in_combat    = 0; 
        restrict_corpse     = 0; 
        restrict_change     = 0; 
        restrict_attach     = 0; 
        auto_attack         = 0; 
        time_type           = 0; 
        long_range          = 0; 
        posdouble           = 0; 
        clslimit            = 0; 
        commoncooldown      = 0; 
        commoncooldowntime  = 0; 
        itemcost            = 0; 
        itemcostcount       = 0; 
        combosk_preskill    = 0; 
        combosk_interval    = 0; 
        combosk_nobreak     = 0; 
#ifdef _SKILL_CLIENT 
        effect              = ""; 
        aerial_effect       = ""; 
#endif 
        range.type          = 5; 
        has_stateattack     = 0; 
        runes_attr          = 0; 
#ifdef _SKILL_CLIENT 
        gfxfilename         = ""; 
        gfxhangpoint        = "0"; 
#endif 
        gfxtarget           = 0; 
        feature             = 0; 
        extra_effect        = 0; 
        immune_casting      = 0; 
        pre_skills.push_back (std::pair < ID, int >(96, 10)); 
        restrict_weapons.push_back (0); 
        restrict_weapons.push_back (292); 
#ifdef _SKILL_SERVER 
        statestub.push_back (new State1 ()); 
        statestub.push_back (new State2 ()); 
        statestub.push_back (new State3 ()); 
#endif 
    } 
        int GetExecutetime (Skill * skill) const
        {
            return 1200;
        }
    int GetCoolingtime (Skill * skill) const 
    { 
        static int aarray[10] = { 3000,3000,3000,3000,3000,3000,3000,3000,3000,3000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredSp (Skill * skill) const 
    { 
        static int aarray[10] = { 1000000,1000000,1000000,1000000,1000000,1000000,1000000,1000000,1000000,1000000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 89,89,89,89,89,89,89,89,89,89 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredItem (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredMoney (Skill * skill) const 
    { 
        static int aarray[10] = { 2000000,2000000,2000000,2000000,2000000,2000000,2000000,2000000,2000000,2000000 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetRequiredRealmLevel (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
        float GetRadius (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAttackdistance (Skill * skill) const
        {
            return (float) (0);
        }
        float GetAngle (Skill * skill) const
        {
            return (float) (1 - 0.0111111 * (0));
        }
        float GetPraydistance (Skill * skill) const
        {
            return (float) (0);
        }
    float GetMpcost (Skill * skill) const 
    { 
        static float aarray[10] = { 265,265,265,265,265,265,265,265,265,265 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    bool CheckComboSkExtraCondition (Skill * skill) const 
    { 
        return 1; 
    } 
    int GetCoolDownLimit (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
    int GetCostShieldEnergy (Skill * skill) const 
    { 
        static int aarray[10] = { 0,0,0,0,0,0,0,0,0,0 }; 
        return aarray[skill->GetLevel () - 1]; 
    } 
#ifdef _SKILL_CLIENT 
        int GetIntroduction (Skill * skill, wchar_t * buffer, int length, wchar_t * format) const
        {
            return _snwprintf (buffer, length, format, 265);

        }
#endif 
#ifdef _SKILL_SERVER 
        int GetEnmity (Skill * skill) const
        {
            return 0;
        }
#endif 
#ifdef _SKILL_SERVER 
    int GetMaxAbility (Skill * skill) const 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        bool StateAttack (Skill * skill) const
        {
            skill->GetVictim ()->SetProbability (1.0 * 100);
            skill->GetVictim ()->SetTime (900000);
            skill->GetVictim ()->SetRatio (1.5);
            skill->GetVictim ()->SetAmount (24);
            skill->GetVictim ()->SetFireshield (1);
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
    bool BlessMe (Skill * skill) const 
    { 
        return 1; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        float GetEffectdistance (Skill * skill) const
        {
            return (float) (20);
        }
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent0 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent1 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent2 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent3 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
    float GetTalent4 (PlayerWrapper * player) 
    { 
        return 0; 
    } 
#endif 
#ifdef _SKILL_SERVER 
        int GetAttackspeed (Skill * skill) const
        {
            return 7;
        }
#endif 
#ifdef _SKILL_SERVER 
        bool TakeEffect (Skill * skill) const
        {;
            return true;
        }
#endif 
#ifdef _SKILL_SERVER 
        float GetHitrate (Skill * skill) const
        {
            return (float) (1.0);
        }
#endif 
#ifdef _SKILL_SERVER 
    void ComboSkEndAction (Skill * skill) const 
    { 
        return; 
    } 
#endif 
    }; 
} 
#endif 
